dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
<?xml version="1.0" encoding="ascii"?>
<!-- File naming: Dialog_D2632AA.svd -->
<!--
  Copyright (C) 2019 Dialog Semiconductor.
  This computer program includes Confidential, Proprietary Information  
  of Dialog Semiconductor. All Rights Reserved.

  Purpose: System Viewer Description (SVD) Example (Schema Version 1.3)
           This is a description of a none-existent and incomplete device
		   for demonstration purposes only.

  Generated by cmsis-svd (version 0.2), d.d. January 30, 2019 - 16:44:50
 -->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Dialog</vendor>                   				    <!-- device vendor name -->
  <vendorID>ARM</vendorID>                                        <!-- device vendor short name -->
  <name>DA14531</name>                                          <!-- name of part-->
  <series>DA1453x</series>                                         <!-- device series the device belongs to -->
  <version>1.2</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  <description>DA14531</description>
  <licenseText><!-- this license text will appear in header file. \n forces line breaks -->
  Copyright (C) 2019 Dialog Semiconductor.\n
  This computer program includes Confidential, Proprietary Information  \n
  of Dialog Semiconductor. All Rights Reserved.
</licenseText>
  <cpu><!-- details about the cpu embedded in the device (SVD version 1.2,  see https://www.keil.com/pack/doc/CMSIS/SVD/html/group__cpu_section__gr.html) -->
    <name>CM0plus</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    
    <nvicPrioBits>2</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
		
  </cpu>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
																																									 and register that do not define "size" themselves -->
  <access>read-write</access>                                     <!-- default access permission for all subsequent registers -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->
	
  <peripherals>
	<peripheral>
	<name>adplldig</name>
	<version>1.0</version>
	<description>adplldig registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40003000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>152</size>
	<usage>registers</usage>
</addressBlock>
	<interrupt>
	<name>BLE_WAKEUP_LP</name>
	<description>Wakeup from Low Power Interrupt Request from BLE</description>
	<value>0</value>
</interrupt><interrupt>
	<name>BLE_GEN</name>
	<description>BLE Interrupt Request</description>
	<value>1</value>
</interrupt><interrupt>
	<name>UART</name>
	<description>UART Interrupt Request</description>
	<value>2</value>
</interrupt><interrupt>
	<name>UART2</name>
	<description>UART2 Interrupt Request</description>
	<value>3</value>
</interrupt><interrupt>
	<name>I2C</name>
	<description>I2C Interrupt Request</description>
	<value>4</value>
</interrupt><interrupt>
	<name>SPI</name>
	<description>SPI Interrupt Request</description>
	<value>5</value>
</interrupt><interrupt>
	<name>ADC</name>
	<description>Analog-Digital Converter Interrupt Request</description>
	<value>6</value>
</interrupt><interrupt>
	<name>KEYBRD</name>
	<description>Keyboard Interrupt Request</description>
	<value>7</value>
</interrupt><interrupt>
	<name>BLE_RF_DIAG</name>
	<description>Baseband or Radio Diagnostics Interrupt Request</description>
	<value>8</value>
</interrupt><interrupt>
	<name>RF_CAL</name>
	<description>Radio Calibration Interrupt Request</description>
	<value>9</value>
</interrupt><interrupt>
	<name>GPIO0</name>
	<description>GPIO Interrupt Request through debounce</description>
	<value>10</value>
</interrupt><interrupt>
	<name>GPIO1</name>
	<description>GPIO Interrupt Request through debounce</description>
	<value>11</value>
</interrupt><interrupt>
	<name>GPIO2</name>
	<description>GPIO Interrupt Request through debounce</description>
	<value>12</value>
</interrupt><interrupt>
	<name>GPIO3</name>
	<description>GPIO Interrupt Request through debounce</description>
	<value>13</value>
</interrupt><interrupt>
	<name>GPIO4</name>
	<description>GPIO Interrupt Request through debounce</description>
	<value>14</value>
</interrupt><interrupt>
	<name>SWTIM</name>
	<description>Software Timer (Timer0) Interrupt Request</description>
	<value>15</value>
</interrupt><interrupt>
	<name>WKUP_QUADEC</name>
	<description>Combines the WakeUp and QuadDecoder Interrupt Request</description>
	<value>16</value>
</interrupt><interrupt>
	<name>SWTIM1</name>
	<description>Software Timer (Timer1) Interrupt Request</description>
	<value>17</value>
</interrupt><interrupt>
	<name>RTC</name>
	<description>RTC Alarm Interrupt Request</description>
	<value>18</value>
</interrupt><interrupt>
	<name>DMA</name>
	<description>DMA Interrupt Request</description>
	<value>19</value>
</interrupt><interrupt>
	<name>XTAL32M_RDY</name>
	<description>XTAL32M settling Interrupt Request</description>
	<value>20</value>
</interrupt><interrupt>
	<name>RESERVED21</name>
	<description>Software Interrupt Request</description>
	<value>21</value>
</interrupt><interrupt>
	<name>RESERVED22</name>
	<description>Software Interrupt Request</description>
	<value>22</value>
</interrupt><interrupt>
	<name>RESERVED23</name>
	<description>Software Interrupt Request</description>
	<value>23</value>
</interrupt>
	<registers>
	<register>
	<name>ADPLL_ACC_CTRL_REG</name>
	
