dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>EN_CMF_AVG</name>
	<description>Enable CMF averaging.
0: Disabled
1: Enabled (default)</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLIP_MOD_TUNE_0_TX</name>
	<description>Clipping value for mod_tune 0 in TX mode.</description>
	<bitRange>[28:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLIP_MOD_TUNE_0_RX</name>
	<description>Clipping value for mod_tune 0 in RX mode.</description>
	<bitRange>[12:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_ANATST_CTRL_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>ANATSTSPARE</name>
	<description>Analog test spare outputs.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ANATSTEN</name>
	<description>Analog test enable outputs.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_ANATST_RD_REG</name>
	
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>ANATSTSPARE_IN</name>
	<description>Ana test spare in.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_ANA_CTRL_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0215807b</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DTC_LDO_DMY</name>
	<description>Control signal for TDC/DTC/VPA LDO dummy loads.</description>
	<bitRange>[28:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VPASETTLE</name>
	<description>Allow TDC after an edge on VPA en
00: No
01: Rising
10: Falling
11: Both edges</description>
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TDC_OFFSET</name>
	<description>TDC offset that is to be subtracted from the binary input to obtain the signed value (default 10.5).</description>
	<bitRange>[21:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DTC_EN</name>
	<description>Enable DTC</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DTCOFFSET</name>
	<description>Offset Added to DTC output
For correct reset time requirement, DTCOFFSET must be set to 11 before initiating any radio transaction. </description>
	<bitRange>[14:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TGLDETEN</name>
	<description>Enable PHV toggle and TDC Bubble detection.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EN_CKDCOMOD</name>
	<description>Enable clock registering the dcomod (default = 1).</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INV_CKDCOMOD</name>
	<description>Invert clock polarity of the clock registering the dcomod.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INV_CKPHV</name>
	<description>Invert clock polarity of the clock registering the variable phase accumulator.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INV_CKTDC</name>
	<description>Invert clock polarity of the clock registering the time to digital converter.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TDC_INV</name>
	<description>Invert sign of the time to digital converter output.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TDC_CKVIN_EN</name>
	<description>Enable ckv input of the TDC.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TDC_DTCIN_EN</name>
	<description>Enable DTC input of the TDC.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_ATTR_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>PWR_MODE_TX</name>
	<description>Power mode option to be used for DCO amplitude selection in TX.
0: Low power
1: High performance (default)</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PWR_MODE_RX</name>
	<description>Power mode option to be used for DCO amplitude selection in RX.
0: Low power
1: High performance (default)</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_CN_CTRL_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x09620100</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CH0</name>
	<description>Channel 0 frequency in MHz (CH0) (ufix13)
default: 2402</description>
	<bitRange>[28:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SGN</name>
	<description>Sign bit for the channel step
0: positive (default)
1: negative</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CS</name>
	<description>Channel spacing.
0: 1 MHz spacing
1: 2 MHz spacing (default)</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CN</name>
	<description>Channel number.
Default: 0</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_DCOAMP_CAL_CTRL_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x77770011</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DCOAMPIC_LP_TX</name>
	<description>Initial condition for the DCO amplitude setting, for Low Power TX mode..</description>
	<bitRange>[31:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOAMPIC_LP_RX</name>
	<description>Initial condition for the DCO amplitude setting, for Low Power RX mode..</description>
	<bitRange>[27:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOAMPIC_HP_TX</name>
	<description>Initial condition for the DCO amplitude setting, for High Performance TX mode..</description>
	<bitRange>[23:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOAMPIC_HP_RX</name>
	<description>Initial condition for the DCO amplitude setting, for High Performance RX mode..</description>
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOAMPTM</name>
	<description>Time spend to perform DCO amplitude calibration
0: 1 us
1: 2 us</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AMPCALEN</name>
	<description>Enable DCO amplitude calibration.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KMEDIUM</name>
	<description>Proportional gain setting for medium tuning.</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KCOARSE</name>
	<description>Proportional gain setting for coarse tuning.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_DCO_RD_REG</name>
	
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x1c000007</resetValue>
	<resetMask>0x3fffffff</resetMask>
	<fields><field>
	<name>DCOAMP</name>
	<description>DCO amplitude setting.
The read value is the output of adplldig (towards the analog). So, the read value is even after the overruling.</description>
	<bitRange>[29:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOMOD</name>
	<description>Current state of the DCO mod capacitor bank
(signed)
The open-loop output (before the addition of modulated data). So, it is after averaging, before SDM and addition of the modulated data.</description>
	<bitRange>[25:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFINE</name>
	<description>Current state of the DCO fine capacitor bank
(signed)
ACC outputs are read (the averaged values.)
For CMF we are reading before bin2thm conversion</description>
	<bitRange>[12:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOMEDIUM</name>
	<description>Current state of the DCO medium capacitor bank
(signed)
ACC outputs are read (the averaged values.)
For CMF we are reading before bin2thm conversion</description>
	<bitRange>[6:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOCOARSE</name>
	<description>Current state of the DCO coarse capacitor bank
(signed)
ACC outputs are read (the averaged values.)
For CMF we are reading before bin2thm conversion</description>
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_DIV_CTRL_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0198ff03</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TXDIV_TRIM</name>
	<description>Tx divider trim value.</description>
	<bitRange>[25:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXDIV_TRIM</name>
	<description>Rx divider trim value.</description>
	<bitRange>[16:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXDIV_FB_EN_TX</name>
	<description>Enable rxdiv for FB in TX mode.
0: Disable (default)
1: Enable</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXDIV_FB_EN_RX</name>
	<description>Enable rxdiv for FB in RX mode.
0: Disable
1: Enable (default)</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FBDIV_EN</name>
	<description>Feedback divider enable
1: Enabled
0: Disabled.

If disabled both feedback and RF output clock will be disabled. This bit is intended for test purposes (not for normal usage).</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_FIF_CTRL1_REG</name>
	
