dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000400</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>FIFRX_1M</name>
	<description>IF frequency (in MHz) used in 1 Mbps RX mode
sfix(14,10) - 1 bit sign, 3 bits integer, 10 bits fractional for MHz unit.</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_FIF_CTRL2_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>FIFTX</name>
	<description>IF frequency (in MHz) used in TX mode
sfix(14,10) - 1 bit sign, 3 bits integer, 10 bits fractional for MHz unit.</description>
	<bitRange>[29:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FIFRX_OFFSET</name>
	<description>Offset for the IF frequency (in MHz) in RX mode.
sfix(14,10) - 1 bit sign, 3 bits integer, 10 bits fractional for MHz unit.</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_FREQMEAS_RD_REG</name>
	
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x21000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MEASDONE_OUT</name>
	<description>Signal indicating the state of the frequency counter
0: Measuring frequency
1: Measurement done</description>
	<bitRange>[29:29]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>QUALMONDET</name>
	<description>Clock quality monitoring detector output.</description>
	<bitRange>[26:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TDCBUB</name>
	<description>Detector output indicating a bubble error in the TDC input.</description>
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PHVSA0</name>
	<description>Detector output indicating a stuck-at 0 on the variable phase accumulator input .</description>
	<bitRange>[24:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PHVSA1</name>
	<description>Detector output indicating a stuck-at 1 on the variable phase accumulator input .</description>
	<bitRange>[23:23]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQDIFF</name>
	<description>Measured frequency difference (signed).</description>
	<bitRange>[22:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_FSM_CTRL_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x08f8ae84</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TVPASETTLE</name>
	<description>Settling time required after vpa disable.</description>
	<bitRange>[29:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TSETTLE</name>
	<description>Time spend waiting for settling
0 - 15: 0 - 7.5 us (t = TSETTLE/2)</description>
	<bitRange>[23:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TPASETTLE</name>
	<description>Time spend waiting for PA to settle
0 - 15: 0 - 7.5 us (t = TPASETTLE/2)</description>
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMOD</name>
	<description>Time spend for mod tuning
0 - 15: 0 - 15 us (t = TMOD)</description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TFINE</name>
	<description>Time spend for fine tuning
0 - 15: 0 - 15 us (t = TFINE)</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMEDIUM</name>
	<description>Time spend for medium tuning
0 - 15: 0 - 7.5 us (t = TMEDIUM/2)
If &lt; 1 us and amplitude calibration is enabled TMEDIUM = 1 us.</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TCOARSE</name>
	<description>Time spend for coarse tuning
0 - 15: 0 - 7.5 us (t = TCOARSE/2)</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_INIT_CTRL_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000005</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DCOMODIC</name>
	<description>Initial condition for mod cap bank.
(signed)</description>
	<bitRange>[28:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOFINEIC</name>
	<description>Initial condition for fine cap bank.
(signed)</description>
	<bitRange>[13:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOMEDIUMIC</name>
	<description>Initial condition for medium cap bank.
(signed)</description>
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOCOARSEIC</name>
	<description>Initial condition for coarse cap bank.
(signed)</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_KDCO_CAL_CTRL1_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00009b9b</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>KDCOLF_IN_1M</name>
	<description>Gain setting for the low frequency path in case of not using the calibrated KDCOHF for 1M mode (uint8).</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDCOHFIC_1M</name>
	<description>Initial gain setting for the high frequency path for 1M mode (uint8).</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_KDCO_CAL_CTRL2_REG</name>
	
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x4c14000a</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>KDCOESTDEV</name>
	<description>Frequency deviation used for KDCO estimation:
0: 500 kHz
1: 250 kHz (default)
2: 125 kHz
3: 62.5 kHz</description>
	<bitRange>[31:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDCOCALTX</name>
	<description>Enable for KDCO calibration in transmit mode.</description>
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDCOCALRX</name>
	<description>Enable for KDCO calibration in receive mode.</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDCOLFCALEN</name>
	<description>Enable the use of the (calibrated) value for KDCOHF for the low frequency path.</description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TKDCOCAL</name>
	<description>Time spend for KDCO calibration settling:
0: 0.5 us 16
1: 1 us 32
2: 2 us 64
3: 4 us 128
4: 8 us</description>
	<bitRange>[26:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDCOCN_IC</name>
	<description>Initial condition for channel number related to calibration result.</description>
	<bitRange>[22:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KMOD_ALPHA_1M</name>
	<description>KDCOHF channel dependent trimming constant for 1M mode.
0: No trimming.
&gt;0: KDCOHF is modified with a factor: 1-SGNx(KMOD_ALPHA_1M)x(CN-CN_CAL_RD)/4096</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_KDCO_RD_REG</name>
	
	<addressOffset>0x00000084</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>CAL_KDCOCAL</name>
	<description>Calibration state of the KDCO calibration.</description>
	<bitRange>[23:23]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>KDCOCN</name>
	<description>Channel number related to calibration result.</description>
	<bitRange>[22:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>KDCO_HF_OUT</name>
	<description>kmod_alpha compensated KDCO gain.</description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>KDCO_HF_INT</name>
	<description>KDCO gain.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_KDTCTDC_CAL_CTRL1_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>KDTCIC</name>
	<description>Initial condition for the DTC gain correction.
Calculated according to the following formula:
(DTCres x flo/2)-1 = (kdtcic[6:0]+128)x2kdtcic[8:7]-4
Where DTCres = 24ps for BARIUM</description>
	<bitRange>[31:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTCCN_IC</name>
	<description>Initial condition for channel number related to calibration result.</description>
	<bitRange>[22:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTC_PIPELINE_BYPASS</name>
	<description>Bypass the extra register on prv_phr.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KTDC_IN</name>
	<description>TDC gain setting in case of not using the calibrated gain setting.</description>
	<bitRange>[14:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTC_ALPHA</name>
	<description>KDTC channel dependent trimming constant.
0: No trimming.
&gt;0: KDTC is modified with a factor: 1-SGNx(KDTC_ALPHA)x(CN-CN_CAL_RD)/32768</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_KDTCTDC_CAL_CTRL2_REG</name>
	
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00007f50</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PHRDLY_EXTRA</name>
	<description>Extra one delay to be added to PHRDLY path.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TKDTCCAL</name>
	<description>Time spend waiting for DTC calibration (0-15) 0 - 15 us t = tkdtccal/2.</description>
	<bitRange>[14:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHRDLY</name>
	<description>Delay phr used for kdtc calibration by 1-4 samples, default: 4 samples (3).</description>
	<bitRange>[10:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KTDCCALEN</name>
	<description>Enable calibration of TDC via DTC calibration.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTCCALLG</name>
	<description>Loopgain setting used for DTC calibration.</description>
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTCCAL_INV</name>
	<description>Invert sign of kdtc calibration loop (default: 0).</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTCCALMOD1P</name>
	<description>Chicken bit to change phase of KDTC cal mode 1 phase.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTCCALMOD</name>
	<description>Mode select for KDTC alogrithm:
0: Just-in-time algorithm (least intrusive)
1: Interger lock to Fref/2 and use second clock phase for calibration (no issue with local optimum)</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KDTCCALEN</name>
	<description>Enable DTC calibration.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_KDTC_RD_REG</name>
	
