dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<addressOffset>0x00000088</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>CAL_KDTCCAL</name>
	<description>Calibration state of the KDTC calibration.</description>
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>KDTC_ALPHA_COMP</name>
	<description>KDTC_ALPHA compensated DTC gain setting. Used as TDC gain setting used to correct loopgain.</description>
	<bitRange>[24:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>KDTCCN</name>
	<description>Channel number related to calibration result.</description>
	<bitRange>[15:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>KDTC_OUT</name>
	<description>DTC gain setting updated in tuning state 13. Used for register readback.</description>
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_LF_CTRL1_REG</name>
	
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000818c</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>FINEKZ</name>
	<description>Corner frequency setting of the first order low-pass filter that is used for tuning the fine bank.</description>
	<bitRange>[15:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FINEK</name>
	<description>Loopfilter loopgain frequency during fine tuning.</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FINETAU</name>
	<description>First order low-pass filter c.rst_ner frequency during fine tuning.</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_LF_CTRL2_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x1ca2879e</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RST_TAU_EN</name>
	<description>Enable state machine to control reset of tau filter.</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODKZ</name>
	<description>Loopgain setting of the loop-filter that is used for tuning the MOD bank.</description>
	<bitRange>[29:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODK</name>
	<description>Corner frequency setting of the zero filter that is used for tuning the MOD bank.</description>
	<bitRange>[23:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODTAU</name>
	<description>Corner frequency setting of the first order low-pass filter that is used for tuning the MOD bank.</description>
	<bitRange>[17:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODK_TUNE</name>
	<description>Loopfilter loopgain frequency during mod tuning.</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODTAU_TUNE</name>
	<description>First order low-pass filter c.rst_ner frequency during mod tuning.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_MISC_CTRL_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000da</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>PHR_FRAC_PRESET_VAL</name>
	<description>Preset value for the fractional counter to be set with the first clk_ckr available after the core reset. The counter will start accumulating on this preset value after the active. The preset value is to be used for ToF application.</description>
	<bitRange>[23:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ENFCWMOD</name>
	<description>Enable two point modulation.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ENRESIDUE</name>
	<description>Enable residue correction .</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODDLY</name>
	<description>Delay modulation (injected at the capcitor bank) by 0-3 samples.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESDLY</name>
	<description>Delay residue by 0-3 samples.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DLYFCWDT</name>
	<description>Delay reference path of the two point modulation.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_MON_CTRL_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00fc0f83</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>QUALMONFRCEN</name>
	<description>Force enable of the clock quality monitor.</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QUALMONTRHLD</name>
	<description>Clock quality monitoring threshold.</description>
	<bitRange>[29:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QUALMONWND</name>
	<description>Clock quality monitoring window length.</description>
	<bitRange>[23:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QUALMONMOD</name>
	<description>Clock quality monitoring mode:
0: Highpass output
1: TDC
2: Lowpass output
3: Loop filter output</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HOLD_STATE</name>
	<description>Set a break point at which the tuning state machine will hold it's state.</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFMEAS_MODE</name>
	<description>RF measurement mode for the Divider calibrations.
0 : Jerzy RF measurement.
1 (default): RF measurement for divider calibration.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ENRFMEAS</name>
	<description>Enable open loop frequency measurement.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMREN</name>
	<description>Enable timer for measuring PLL settling time.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TFREQMEAS</name>
	<description>Frequency measurement time
Two lsb's form the linear part, the three MSB's are the exponent
Time [us] = 0.5+((4+lin)*(2^(exp-1)))
tfreqmeas Time [us]
0: 2.5
1: 3
2: 3.5
3: 4
4: 4.5
5: 5.5
6: 6.5
7: 7.5
8: 8.5
9: 10.5
10: 12.5
11: 14.5
12: 16.5
13: 20.5
14: 24.5
15: 28.5
16: 32.5
17: 40.5
18: 48.5
19: 56.5
20: 64.5
21: 80.5
22: 96.5
23: 112.5
24: 128.5
25: 160.5
26: 192.5
27: 224.5
28: 256.5
29: 320.5
30: 384.5
31: 448.5</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_OVERRULE_CTRL1_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>OVR_DTC_OH_WR</name>
	<description>Overrule value (decimal) for the dtc_oh.</description>
	<bitRange>[31:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DTC_OH_SEL</name>
	<description>Overrule dtc_oh output.
0: Normal function (default)
1: Overrule dtc_oh output by OVR_DTC_OH_WR</description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOAMP_WR</name>
	<description>Overrule value for the dcoamp.</description>
	<bitRange>[20:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOAMP_SEL</name>
	<description>Overrule dcoamp output.
0: Normal function (default)
1: Overrule dcoamp output by OVR_DCOAMP_WR</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOAMPHOLD_WR</name>
	<description>Overrule value for the dcoamp_hold..</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOAMPHOLD_SEL</name>
	<description>Overrule dcoamphold output.
0: Normal function (default)
1: Overrule dcoamphold output by OVR_DCOAMPHOLD_WR</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_RDYFORDIV_WR</name>
	<description>Overrule value for the rdy_for_div input.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_RDYFORDIV_SEL</name>
	<description>Overrule rdy_for_div input.
0: Normal function (default)
1: Overrule rdy_for_div input by OVR_RDYFORDIV_WR</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_VPAEN_WR</name>
	<description>Overrule value for the vpa_en.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_VPAEN_SEL</name>
	<description>Overrule vpaen.
0: Normal function (default)
1: Overrule vpaen by OVR_VPAEN_WR</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_SRESETN_WR</name>
	<description>Overrule value for the sreset_n.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_SRESETN_SEL</name>
	<description>Overrule sreset_n of the modulator.
0: Normal function (default)
1: Overrule sreset_n by OVR_SRESETN_WR</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_ENPAIN_WR</name>
	<description>Overrule value for the enpain.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_ENPAIN_SEL</name>
	<description>Overrule enpain input.
0: Normal function (default)
1: Overrule enpain input by OVR_ENPAIN_WR</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_RXBIT_WR</name>
	<description>Overrule value for the rxbit.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_RXBIT_SEL</name>
	<description>Overrule rxbit input.
0: Normal function (default)
1: Overrule rxbit input by OVR_RXBIT_WR</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_ACTIVE_WR</name>
	<description>Overrule value for the active.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_ACTIVE_SEL</name>
	<description>Overrule active input.
0: Normal function (default)
1: Overrule active input by OVR_ACTIVE_WR</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_OVERRULE_CTRL2_REG</name>
	
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>OVR_DCOMOD_WR</name>
	<description>Overrule value (decimal) for the internal dcomod.The overrule value is in the same format as the SDM output.</description>
	<bitRange>[31:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOMOD_SEL</name>
	<description>Overrule dcomod.
0: Normal function (default)
1: Overrule dcomod by OVR_DCOMOD_WR</description>
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOFINE_WR</name>
	<description>Overrule value (decimal) for the internal dcofine.The overrule value is in the same format as the ACC output.</description>
	<bitRange>[22:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOFINE_SEL</name>
	<description>Overrule dcofine.
0: Normal function (default)
1: Overrule dcofine by OVR_DCOFINE_WR</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOMEDIUM_WR</name>
	<description>Overrule value (decimal) for the internal dcomedium.The overrule value is in the same format as the ACC output.</description>
	<bitRange>[11:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOMEDIUM_SEL</name>
	<description>Overrule dcomedium.
0: Normal function (default)
1: Overrule dcomedium by OVR_DCOMEDIUM_WR</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOCOARSE_WR</name>
	<description>Overrule value (decimal) for the internal dcocoarse.The overrule value is in the same format as the ACC output.</description>
	<bitRange>[4:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_DCOCOARSE_SEL</name>
	<description>Overrule dcocoarse.
0: Normal function (default)
1: Overrule dcocoarse by OVR_DCOCOARSE_WR</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_OVERRULE_CTRL3_REG</name>
	
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>OVR_RXDIV_FB_EN_WR</name>
	<description>Overrule value for the rxdiv_fb_en output.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_RXDIV_FB_EN_SEL</name>
	<description>Overrule rxdiv_fb_en output.
0: Normal function (default)
1: Overrule rxdiv_fb_en output by OVR_RXDIV_FB_EN_WR</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_FBDIV_EN_WR</name>
	<description>Overrule value for the fbdiv_en output.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_FBDIV_EN_SEL</name>
	<description>Overrule fbdiv_en output.
0: Normal function (default)
1: Overrule fbdiv_en output by OVR_FBDIV_EN_WR</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_TXDIV_EN_WR</name>
	<description>Overrule value for the txdiv_en output.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_TXDIV_EN_SEL</name>
	<description>Overrule txdiv_en output.
0: Normal function (default)
1: Overrule txdiv_en output by OVR_TXDIV_EN_WR</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_RXDIV_EN_WR</name>
	<description>Overrule value for the rxdiv_en output.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVR_RXDIV_EN_SEL</name>
	<description>Overrule rxdiv_en.
0: Normal function (default)
1: Overrule rxdiv_en output by OVR_RXDIV_EN_WR</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_PLLFCWDT_RD_REG</name>
	
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00258800</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields><field>
	<name>PLLFCWDT</name>
	<description>PLLFCWDT.</description>
	<bitRange>[22:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_RFPT_CTRL_REG</name>
	
