dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>RFPT_RATE</name>
	<description>RFPT rate setting
0: 16MSPS
1: 8 MSPS</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INV_CKRFPT</name>
	<description>Invert clock registering output of the RFPT interface.

Note:
Please check bug2522A_018 (DEM 16Msps data need 16MHz RFCU clock).</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFPT_MUX</name>
	<description>Multiplexer setting for RFPT interface output.
The following data will be provided to the rfpt interface:
0: Disabled
1: {5'd0, tdc_invert, tdc_b}
2: {tdc_t_reg[20:5]}
3: {dcocoarse, 1'd0,dcomedium, 2'd0,dcofine}
4: {8'd0, dcomod_sdm}
5: {1'd0, phr_int0, phe_int_int}
6: {2'd0, phe_int, 1'd0,phv_int}
7: {7'd0, kdtc_int}
8: {2'd0, int_state,lpout}
9: {7'd0, lfout_int,lfout_frac}
10: {4'd0, txfcwdt}
11: {1'd0, dcocoarse_t}
12: {2'd0, dcofine_t, dcomedium_t}
13: {dcomod_t[15:0]}
14: {rdata_in}
15: {5'd0, dcoamphold_in, rxdiven_in, txdiven_in, fbdiven_in, rxdivfben_in, dcomod_b, dcofine_b}

Note:
- Please check bug2522A_018 (DEM 16Msps data need 16MHz RFCU clock).
- Before enabling the RFPT output by setting RFPT_MUX to a non-zero value, RF_ADPLLDIG_RFMON_CTRL_REG[ADPLLDIG_RFMON_MUX_SEL] should be set to the value (a value other than 'b000 and 'b001) which enables adplldig_rfmon data capturing.</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_SDMOD_CTRL_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000039</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SDMMODETX</name>
	<description>Sigma delta modulator mode for TX:
0: Disabled
1: MASH I
3: MASH II
5: MASH I + with dithering
7: MASH II + with dithering</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDMMODERX</name>
	<description>Sigma delta modulator mode for RX:
0: Disabled
1: MASH I
3: MASH II
5: MASH I + with dithering
7: MASH II + with dithering</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_TUNESTATE_RD_REG</name>
	
	<addressOffset>0x0000008c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>TMRVAL</name>
	<description>Current timer value. Timer can be used to determine PLL settling time and is used for frequency measurement.</description>
	<bitRange>[13:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TUNE_STATE</name>
	<description>Binary coded state of the tuning state machine.</description>
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_TXMOD_CTRL_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>INV_CKMODEXT</name>
	<description>Invert the clock, which captures the external modulated data or tx_data_en.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_MODE</name>
	<description>Two-point modulation MUX:
0,3: mod_hf = mod_in
mod_lf = mod_in
1: mod_hf = 0
mod_lf = mod_in
2: mod_hf = mod_in
mod_lf = 0</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EO_PACKET_DIS</name>
	<description>The block will normally detect the end of a data packet by the missing tx_data_en pulses.
The outputs will be smoothly return to zero when an end of a data packet has been deteted.
The end of a data packet detected can be disabled by setting eo_packet_dis = 1. This is
normally/never used and eo_packet_dis should always be set to zero.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MOD_INDEX</name>
	<description>Modulation index selection:
0: h = 1/2 (dF = 250 kHz)
1: h = 11/32 (dF = 172 kHz):
2: h = 17/32 (dF = 266 kHz)
3: h = 69/128 (dF = 270 kHz)</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_DATA_INV</name>
	<description>Select polarity of the modulation prior to pulse shaping
0: Normal operation
1: Invert modulation signal</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BT_SEL</name>
	<description>The BT product for the Gaussian pulse can take the values 0.5 or 0.6.
0: BT = 0.5
1: BT = 0.6</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>ANAMISC</name>
	<version>1.0</version>
	<description>ANAMISC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001600</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>8</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>CLK_REF_CNT_REG</name>
	<description>Count value for oscillator calibration</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>REF_CNT_VAL</name>
	<description>Indicates the calibration time, with a decrement counter to 1. </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_REF_SEL_REG</name>
	<description>Select clock for oscillator calibration</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>EXT_CNT_EN_SEL</name>
	<description>0 : Enable XTAL_CNT counter by the REF_CLK selected by REF_CLK_SEL.
1 : Enable XTAL_CNT counter from an external input.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>REF_CAL_START</name>
	<description>Writing a '1' starts a calibration of the clock selected by CLK_REF_SEL_REG[REF_CLK_SEL]. This bit is cleared when calibration is finished, and CLK_REF_VAL is ready. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>REF_CLK_SEL</name>
	<description>Select clock input for calibration:
0x0 : RC32K
0x1 : RC32M
0x2 : XTAL32K
0x3 : RCX</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_REF_VAL_H_REG</name>
	<description>XTAL32M reference cycles, higher 16 bits</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>XTAL_CNT_VAL</name>
	<description>Returns the number of DIVN clock cycles counted during the calibration time, defined with REF_CNT_VAL </description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CLK_REF_VAL_L_REG</name>
	<description>XTAL32M reference cycles, lower 16 bits</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>XTAL_CNT_VAL</name>
	<description>Returns the number of DIVN clock cycles counted during the calibration time, defined with REF_CNT_VAL </description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>BLE</name>
	<version>1.0</version>
	<description>BLE registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40000000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>532</size>
	<usage>registers</usage>
</addressBlock>
	
