dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<registers>
	<register>
	<name>BLE_ACTSCANSTAT_REG</name>
	<description>Active scan register</description>
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00010001</resetValue>
	<resetMask>0x01ff01ff</resetMask>
	<fields><field>
	<name>BACKOFF</name>
	<description>Active scan mode back-off counter initialization value. </description>
	<bitRange>[24:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>UPPERLIMIT</name>
	<description>Active scan mode upper limit counter value. </description>
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>BLE_ADVCHMAP_REG</name>
	<description>Advertising Channel Map</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000007</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>ADVCHMAP</name>
	<description>Advertising Channel Map, defined as per the advertising connection settings. Contains advertising channels index 37 to 39. If ADVCHMAP[i] equals:
0: Do not use data channel i+37.
1: Use data channel i+37. </description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_ADVTIM_REG</name>
	<description>Advertising Packet Interval</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>ADVINT</name>
	<description>Advertising Packet Interval defines the time interval in between two ADV_xxx packet sent. Value is in us.
Value to program depends on the used Advertising Packet type and the device filtering policy. </description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_AESCNTL_REG</name>
	<description>Start AES register</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>AES_MODE</name>
	<description>0: Cipher mode
1: Decipher mode</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AES_START</name>
	<description>Writing a 1 starts AES-128 ciphering/deciphering process.
This bit is reset once the process is finished (i.e. ble_crypt_irq interrupt occurs, even masked) </description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>BLE_AESKEY127_96_REG</name>
	<description>AES encryption key</description>
	<addressOffset>0x000000d0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>AESKEY127_96</name>
	<description>AES encryption 128-bit key. Bit 127 down to 96 </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_AESKEY31_0_REG</name>
	<description>AES encryption key</description>
	<addressOffset>0x000000c4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>AESKEY31_0</name>
	<description>AES encryption 128-bit key. Bit 31 down to 0 </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_AESKEY63_32_REG</name>
	<description>AES encryption key</description>
	<addressOffset>0x000000c8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>AESKEY63_32</name>
	<description>AES encryption 128-bit key. Bit 63 down to 32 </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_AESKEY95_64_REG</name>
	<description>AES encryption key</description>
	<addressOffset>0x000000cc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>AESKEY95_64</name>
	<description>AES encryption 128-bit key. Bit 95 down to 64 </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_AESPTR_REG</name>
	<description>Pointer to the block to encrypt/decrypt</description>
	<addressOffset>0x000000d4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>AESPTR</name>
	<description>Pointer to the memory zone where the block to cipher/decipher using AES-128 is stored. </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_BASETIMECNTCORR_REG</name>
	<description>Base Time Counter</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x07ffffff</resetMask>
	<fields><field>
	<name>BASETIMECNTCORR</name>
	<description>Base Time Counter correction value. </description>
	<bitRange>[26:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_BASETIMECNT_REG</name>
	<description>Base time reference counter</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x07ffffff</resetMask>
	<fields><field>
	<name>BASETIMECNT</name>
	<description>Value of the 625us base time reference counter. Updated each time SAMPCLK is written. Used by the SW in order to synchronize with the HW </description>
	<bitRange>[26:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>BLE_BDADDRL_REG</name>
	<description>BLE device address LSB register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BDADDRL</name>
	<description>Bluetooth Low Energy Device Address. LSB part.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_BDADDRU_REG</name>
	<description>BLE device address MSB register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0001ffff</resetMask>
	<fields><field>
	<name>PRIV_NPUB</name>
	<description>Bluetooth Low Energy Device Address privacy indicator
0: Public Bluetooth Device Address
1: Private Bluetooth Device Address </description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BDADDRU</name>
	<description>Bluetooth Low Energy Device Address. MSB part. </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_BLEMPRIO0_REG</name>
	<description>Coexistence interface Priority 0 Register</description>
	<addressOffset>0x00000108</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x3489adef</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BLEM7</name>
	<description>Set Priority value for Passive Scanning </description>
	<bitRange>[31:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLEM6</name>
	<description>Set Priority value for Non-Connectable Advertising </description>
	<bitRange>[27:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLEM5</name>
	<description>Set Priority value for Connectable Advertising BLE message </description>
	<bitRange>[23:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLEM4</name>
	<description>Set Priority value for Active Scanning BLE message </description>
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLEM3</name>
	<description>Set Priority value for Initiating (Scanning) BLE message </description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLEM2</name>
	<description>Set Priority value for Data Channel transmission BLE message </description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLEM1</name>
	<description>Set Priority value for LLCP BLE message </description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLEM0</name>
	<description>Set Priority value for Initiating (Connection Request Response) BLE message </description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_BLEMPRIO1_REG</name>
	<description>Coexistence interface Priority 1 Register</description>
	<addressOffset>0x0000010c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x30000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BLEMDEFAULT</name>
	<description>Set default priority value for other BLE message than those defined above </description>
	<bitRange>[31:28]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_CNTL2_REG</name>
	<description>BLE Control Register 2</description>
	<addressOffset>0x00000200</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BLE_PHY_ERR_MSK_N</name>
	
