dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLE_ARP_ERR_MSK_N</name>
	<description>When cleared to &quot;0&quot; then it masks the BLE_ARP_ERR_STAT in order to not trigger a BLE_ERROR_IRQ.</description>
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLE_ARP_PHY_ERR_STAT</name>
	<description>When set to &quot;1&quot; then an error occured in BLE ARP sub-block and the BLE_GEN_IRQ will be aserted.
It will be set if the ARP_ERROR or PHY_ERROR will be asserted and if the BLE_ARP_ERR_MSK is set to &quot;1&quot;.
Writing the value &quot;1&quot; will acknowledge and clear this field.</description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLE_RSSI_SEL</name>
	<description>0: (default) Select Peak-hold RSSI value during the SYNC_FOUND event:
CS-&gt;RXRSSI[7:0] = RF_RSSI_RESULT_REG-&gt;RSSI_LATCHED_RD[9:2].
1: Select the Average RSSI value during the SYNC_FOUND event:
CS-&gt;RXRSSI[7:0] = RF_RSSI_RESULT_REG-&gt;RSSI_AVG_RD[9:2].</description>
	<bitRange>[21:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WAKEUPLPSTAT</name>
	<description>The status of the BLE_WAKEUP_LP_IRQ. The Interrupt Service Routine of BLE_WAKEUP_LP_IRQ should return only when the WAKEUPLPSTAT is cleared.
Note that BLE_WAKEUP_LP_IRQ is automatically acknowledged after the power up of the Radio Subsystem, plus one Low Power Clock period. </description>
	<bitRange>[20:20]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SW_RPL_SPI</name>
	<description>Keep to 0. </description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BB_ONLY</name>
	<description>Keep to 0.</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLE_PTI_SOURCE_SEL</name>
	<description>0: Provide to COEX block the PTI value indicated by the Control Structure. Recommended value is &quot;0&quot;.
1: Provide to COEX block the PTI value generated dynamically by the BLE core, which is based on the PTI of the Control Structure.</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLE_CLK_SEL</name>
	<description>BLE Clock Select.
Specifies the BLE master clock absolute frequency in MHz.
Typical values are 16 and 8.
Value depends on the selected XTAL frequency and the value of CLK_RADIO_REG[BLE_DIV] bitfield. For example, if XTAL oscillates at 16MHz and CLK_RADIO_REG[BLE_DIV] = 1 (divide by 2), then BLE master clock frequency is 8MHz and BLE_CLK_SEL should be set to value 8.
The selected BLE master clock frequency (affected by BLE_DIV and BLE_CLK_SEL) must be modified and set only during the initialization time, i.e. before setting BLE_RWBLECNTL_REG[RWBLE_EN] to 1.
Refer also to BLE_RWBLECONF_REG[CLK_SEL].</description>
	<bitRange>[14:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIO_PWRDN_ALLOW</name>
	<description>This active high signal indicates when it is allowed for the BLE core (embedded in the Radio sub-System power domain) to be powered down.
After the assertion of the BLE_DEEPSLCNTL_REG[DEEP_SLEEP_ON] a hardware sequence based on the Low Power clock will cause the assertion of RADIO_PWRDN_ALLOW. The RADIO_PWRDN_ALLOW will be cleared to &quot;0&quot; when the BLE core exits from the sleep state, i.e. when the BLE_SLP_IRQ will be asserted.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MON_LP_CLK</name>
	<description>The SW can only write a &quot;0&quot; to this bit.
Whenever a positive edge of the low power clock used by the BLE Timers is detected, then the HW will automatically set this bit to &quot;1&quot;. This functionality will not work if BLE Timer is in reset state (refer to CLK_RADIO_REG[BLE_LP_RESET]).
This bit can be used for SW synchronization, to debug the low power clock, etc.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BLE_CLK_STAT</name>
	<description>0: BLE uses low power clock
1: BLE uses master clock </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BLE_DIAG_OVR</name>
	<description>1: Overrule BLE_DIAG.
0: BLE_DIAG is not overruled.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EMACCERRMSK</name>
	<description>Exchange Memory Access Error Mask:
When cleared to &quot;0&quot; the EM_ACC_ERR will not cause an BLE_ERROR_IRQ interrupt.
When set to &quot;1&quot; an BLE_ERROR_IRQ will be generated as long as EM_ACC_ERR is &quot;1&quot;. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EMACCERRACK</name>
	<description>Exchange Memory Access Error Acknowledge.
When the SW writes a &quot;1&quot; to this bit then the EMACCERRSTAT bit will be cleared.
When the SW writes &quot;0&quot; it will have no affect.
The read value is always &quot;0&quot;. </description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>EMACCERRSTAT</name>
	<description>Exchange Memory Access Error Status:
The bit is read-only and can be cleared only by writing a &quot;1&quot; at EMACCERRACK bitfield.
This bit will be set to &quot;1&quot; by the hardware when the controller will access an EM page that is not mapped according to the EM_MAPPING value.
When this bit is &quot;1&quot; then the BLE_ERROR_IRQ will be asserted as long as EMACCERRMSK is &quot;1&quot;. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>BLE_COEXIFCNTL0_REG</name>
	<description>Coexistence interface Control 0 Register</description>
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x003300f3</resetMask>
	<fields><field>
	<name>WLCRXPRIOMODE</name>
	<description>Defines Bluetooth Low Energy packet ble_rx mode behavior.
00: Rx indication excluding Rx Power up delay (starts when correlator is enabled)
01: Rx indication including Rx Power up delay
10: Rx High priority indicator
11: n/a</description>
	<bitRange>[21:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WLCTXPRIOMODE</name>
	<description>Defines Bluetooth Low Energy packet ble_tx mode behavior
00: Tx indication excluding Tx Power up delay
01: Tx indication including Tx Power up delay
10: Tx High priority indicator
11: n/a</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WLANTXMSK</name>
	<description>Determines how wlan_tx impact BLE Tx and Rx
00: wlan_tx has no impact (default mode)
01: wlan_tx can stop BLE Tx, no impact on BLE Rx
10: wlan_tx can stop BLE Rx, no impact on BLE Tx
11: wlan_tx can stop both BLE Tx and BLE Rx</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WLANRXMSK</name>
	<description>Determines how wlan_rx impact BLE Tx and Rx
00: wlan_rx has no impact
01: wlan_rx can stop BLE Tx, no impact on BLE Rx (default mode)
10: wlan_rx can stop BLE Rx, no impact on BLE Tx
11: wlan_rx can stop both BLE Tx and BLE Rx</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYNCGEN_EN</name>
	<description>Determines whether ble_sync is generated or not.
0: ble_sync pulse not generated
1: ble_sync pulse generated</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_EN</name>
	<description>Enable / Disable control of the MWS/WLAN Coexistence control
0: Coexistence interface disabled
1: Coexistence interface enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_COEXIFCNTL1_REG</name>
	<description>Coexistence interface Control 1 Register</description>
	<addressOffset>0x00000104</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x1f1f7f7f</resetMask>
	<fields><field>
	<name>WLCPRXTHR</name>
	<description>Applies on ble_rx if WLCRXPRIOMODE equals 10
Determines the threshold for Rx priority setting.
If ble_pti[3:0] output value is greater than WLCPRXTHR, then Rx Bluetooth Low Energy priority is considered as high, and must be provided to the WLAN coexistence interface </description>
	<bitRange>[28:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WLCPTXTHR</name>
	<description>Applies on ble_tx if WLCTXPRIOMODE equals 10
Determines the threshold for priority setting.
If ble_pti[3:0] output value is greater than WLCPTXTHR, then Tx Bluetooth Low Energy priority is considered as high, and must be provided to the WLAN coexistence interface </description>
	<bitRange>[20:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WLCPDURATION</name>
	<description>Applies on ble_tx if WLCTXPRIOMODE equals 10
Applies on ble_rx if WLCRXPRIOMODE equals 10
Determines how many s the priority information must be maintained
Note that if WLCPDURATION = 0x00, then Tx/Rx priority levels are maintained till Tx/Rx EN are de-asserted. </description>
	<bitRange>[14:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WLCPDELAY</name>
	<description>Applies on ble_tx if WLCTXPRIOMODE equals 10.
Applies on ble_rx if WLCRXPRIOMODE equals 10.
Determines the delay (in us) in Tx/Rx enables rises the time Bluetooth Low energy Tx/Rx priority has to be provided . </description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_CURRENTRXDESCPTR_REG</name>
	<description>Rx Descriptor Pointer for the Receive Buffer Chained List</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>ETPTR</name>
	<description>Exchange Table Pointer that determines the starting point of the Exchange Table</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CURRENTRXDESCPTR</name>
	<description>Rx Descriptor Pointer that determines the starting point of the Receive Buffer Chained List </description>
	<bitRange>[14:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_DEBUGADDMAX_REG</name>
	<description>Upper limit for the memory zone</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>REG_ADDMAX</name>
	<description>Upper limit for the Register zone indicated by the reg_inzone flag </description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EM_ADDMAX</name>
	<description>Upper limit for the Exchange Memory zone indicated by the em_inzone flag </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_DEBUGADDMIN_REG</name>
	<description>Lower limit for the memory zone</description>
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>REG_ADDMIN</name>
	<description>Lower limit for the Register zone indicated by the reg_inzone flag </description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EM_ADDMIN</name>
	<description>Lower limit for the Exchange Memory zone indicated by the em_inzone flag </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_DEEPSLCNTL_REG</name>
	<description>Deep-Sleep control register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>EXTWKUPDSB</name>
	<description>External Wake-Up disable
0: RW-BLE Core can be woken by external wake-up
1: RW-BLE Core cannot be woken up by external wake-up </description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEEP_SLEEP_STAT</name>
	<description>Indicator of current Deep Sleep clock mux status:
0: RW-BLE Core is not yet in Deep Sleep Mode
1: RW-BLE Core is in Deep Sleep Mode (only low_power_clk is running) </description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SOFT_WAKEUP_REQ</name>
	<description>Wake Up Request from RW-BLE Software. Applies when system is in Deep Sleep Mode. It wakes up the RW-BLE Core when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEEP_SLEEP_CORR_EN</name>
	<description>625us base time reference integer and fractional part correction. Applies when system has been woken-up from Deep Sleep Mode. It enables Fine Counter and Base Time counter when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0. </description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DEEP_SLEEP_ON</name>
	<description>0: RW-BLE Core in normal active mode
1: Request RW-BLE Core to switch in deep sleep mode.
This bit is reset on DEEP_SLEEP_STAT falling edge. </description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DEEP_SLEEP_IRQ_EN</name>
	<description>Always set to &quot;3&quot; when DEEP_SLEEP_ON is set to &quot;1&quot;.
It controls the generation of BLE_WAKEUP_LP_IRQ. </description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_DEEPSLSTAT_REG</name>
	<description>Duration of the last deep sleep phase register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DEEPSLDUR</name>
	<description>Actual duration of the last deep sleep phase measured in low_power_clk clock cycle. DEEPSLDUR is set to zero at the beginning of the deep sleep phase, and is incremented at each low_power_clk clock cycle until the end of the deep sleep phase. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>BLE_DEEPSLWKUP_REG</name>
	<description>Time (measured in Low Power clock cycles) in Deep Sleep Mode before waking-up the device</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DEEPSLTIME</name>
	<description>Determines the time in low_power_clk clock cycles to spend in Deep Sleep Mode before waking-up the device. This ensures a maximum of 37 hours and 16mn sleep mode capabilities at 32kHz. This ensures a maximum of 36 hours and 16mn sleep mode capabilities at 32.768kHz </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_DIAGCNTL2_REG</name>
	<description>Debug use only</description>
	<addressOffset>0x0000020c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DIAG7_EN</name>
	<description>0: Disable diagnostic port 0 output. All outputs are set to 0x0.
1: Enable diagnostic port 0 output.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG7</name>
	<description>Only relevant when DIAG7_EN = 1.
Selection of the outputs that must be driven to the diagnostic port BLE_DIAG7. </description>
	<bitRange>[29:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG6_EN</name>
	<description>0: Disable diagnostic port 0 output. All outputs are set to 0x0.
1: Enable diagnostic port 0 output.</description>
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG6</name>
	<description>Only relevant when DIAG6_EN = 1.
Selection of the outputs that must be driven to the diagnostic port BLE_DIAG6. </description>
	<bitRange>[21:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG5_EN</name>
	<description>0: Disable diagnostic port 0 output. All outputs are set to 0x0.
1: Enable diagnostic port 0 output.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG5</name>
	<description>Only relevant when DIAG5_EN= 1.
Selection of the outputs that must be driven to the diagnostic port BLE_DIAG5.</description>
	<bitRange>[13:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG4_EN</name>
	<description>0: Disable diagnostic port 0 output. All outputs are set to 0x0.
1: Enable diagnostic port 0 output.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG4</name>
	<description>Only relevant when DIAG4_EN = 1.
Selection of the outputs that must be driven to the diagnostic port BLE_DIAG4.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_DIAGCNTL3_REG</name>
	<description>Debug use only</description>
	<addressOffset>0x00000210</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DIAG7_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG7_BIT</name>
	<description>Selects which bit from the DIAG7 word will be forwarded to bit 7 of the BLE DIagnostic Port.</description>
	<bitRange>[30:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG6_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG6_BIT</name>
	<description>Selects which bit from the DIAG6 word will be forwarded to bit 6 of the BLE DIagnostic Port.</description>
	<bitRange>[26:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG5_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG5_BIT</name>
	<description>Selects which bit from the DIAG5 word will be forwarded to bit 5 of the BLE DIagnostic Port.</description>
	<bitRange>[22:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG4_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG4_BIT</name>
	<description>Selects which bit from the DIAG4 word will be forwarded to bit 4 of the BLE DIagnostic Port.</description>
	<bitRange>[18:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG3_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG3_BIT</name>
	<description>Selects which bit from the DIAG3 word will be forwarded to bit 3 of the BLE DIagnostic Port.</description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG2_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG2_BIT</name>
	<description>Selects which bit from the DIAG2 word will be forwarded to bit 2 of the BLE DIagnostic Port.</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_BIT</name>
	<description>Selects which bit from the DIAG1 word will be forwarded to bit 1 of the BLE DIagnostic Port.</description>
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG0_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG0_BIT</name>
	<description>Selects which bit from the DIAG0 word will be forwarded to bit 0 of the BLE DIagnostic Port.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_DIAGCNTL_REG</name>
	<description>Diagnostics Register</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DIAG3_EN</name>
	<description>0: Disable diagnostic port 0 output. All outputs are set to 0x0.
1: Enable diagnostic port 0 output. </description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG3</name>
	<description>Only relevant when DIAG3_EN = 1.
Selection of the outputs that must be driven to the diagnostic port BLE_DIAG3. </description>
	<bitRange>[29:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG2_EN</name>
	<description>0: Disable diagnostic port 0 output. All outputs are set to 0x0.
1: Enable diagnostic port 0 output. </description>
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG2</name>
	<description>Only relevant when DIAG2_EN = 1.
Selection of the outputs that must be driven to the diagnostic port BLE_DIAG2. </description>
	<bitRange>[21:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_EN</name>
	<description>0: Disable diagnostic port 0 output. All outputs are set to 0x0.
1: Enable diagnostic port 0 output. </description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1</name>
	<description>Only relevant when DIAG1_EN = 1.
Selection of the outputs that must be driven to the diagnostic port BLE_DIAG1. </description>
	<bitRange>[13:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG0_EN</name>
	<description>0: Disable diagnostic port 0 output. All outputs are set to 0x0.
1: Enable diagnostic port 0 output. </description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG0</name>
	<description>Only relevant when DIAG0_EN = 1.
Selection of the outputs that must be driven to the diagnostic port BLE_DIAG0. </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_DIAGSTAT_REG</name>
	<description>Debug use only</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DIAG3STAT</name>
	<description>Directly connected to ble_dbg3[7:0] output. Debug use only. </description>
	<bitRange>[31:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG2STAT</name>
	<description>Directly connected to ble_dbg2[7:0] output. Debug use only. </description>
	<bitRange>[23:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG1STAT</name>
	<description>Directly connected to ble_dbg1[7:0] output. Debug use only. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG0STAT</name>
