dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<description>Directly connected to ble_dbg0[7:0] output. Debug use only. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>BLE_EM_BASE_REG</name>
	<description>Exchange Memory Base Register</description>
	<addressOffset>0x00000208</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BLE_EM_BASE_16_10</name>
	<description>The physical address on the system memory map of the base of the Exchange Memory.</description>
	<bitRange>[16:10]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_ENBPRESET_REG</name>
	<description>Time in low power oscillator cycles register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TWEXT</name>
	<description>Minimum and recommended value is &quot;TWIRQ_RESET + 1&quot;.
In the case of wake-up due to an external wake-up request, TWEXT specifies the time delay in low power oscillator cycles to deassert BLE_WAKEUP_LP_IRQ.
Refer also to GP_CONTROL_REG[BLE_WAKEUP_REQ].
Range is [0...64 ms] for 32kHz; [0...62.5 ms] for 32.768kHz </description>
	<bitRange>[31:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TWIRQ_SET</name>
	<description>Minimum value is &quot;TWIRQ_RESET + 1&quot;.
Time in low power oscillator cycles to set BLE_WAKEUP_LP_IRQ before the BLE sleep timer expiration.
Refer also to BLE_DEEPSLWKUP_REG[DEEPSLTIME].
Range is [0...64 ms] for 32kHz; [0...62.5 ms] for 32.768kHz </description>
	<bitRange>[20:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TWIRQ_RESET</name>
	<description>Recommended value is 1.
Time in low power oscillator cycles to reset BLE_WAKEUP_LP_IRQ before the BLE sleep timer expiration.
Refer also to BLE_DEEPSLWKUP_REG[DEEPSLTIME].
Range is [0...32 ms] for 32kHz; [0...31.25 ms] for 32.768kHz. </description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_ERRORTYPESTAT_REG</name>
	<description>Error Type Status registers</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>CONCEVTIRQ_ERROR</name>
	<description>Indicates whether two consecutive and concurrent ble_event_irq have been generated, and not acknowledged in time by the RW-BLE Software.
0: No error
1: Error occurred</description>
	<bitRange>[17:17]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RXDATA_PTR_ERROR</name>
	<description>Indicates whether Rx data buffer pointer value programmed is null: this is a major programming failure.
0: No error
1: Error occurred </description>
	<bitRange>[16:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TXDATA_PTR_ERROR</name>
	<description>Indicates whether Tx data buffer pointer value programmed is null during Advertising / Scanning / Initiating events, or during Master / Slave connections with non-null packet length: this is a major programming failure.
0: No error
1: Error occurred </description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RXDESC_EMPTY_ERROR</name>
	<description>Indicates whether Rx Descriptor pointer value programmed in register is null: this is a major programming failure.
0: No error
1: Error occurred </description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TXDESC_EMPTY_ERROR</name>
	<description>Indicates whether Tx Descriptor pointer value programmed in Control Structure is null during Advertising / Scanning / Initiating events: this is a major programming failure.
0: No error
1: Error occurred </description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CSFORMAT_ERROR</name>
	<description>Indicates whether CS-FORMAT has been programmed with an invalid value: this is a major software programming failure.
0: No error
1: Error occurred </description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LLCHMAP_ERROR</name>
	<description>Indicates Link Layer Channel Map error, happens when actual number of CS-LLCHMAP bit set to one is different from CS-NBCHGOOD at the beginning of Frequency Hopping process
0: No error
1: Error occurred </description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADV_UNDERRUN</name>
	<description>Indicates Advertising Interval Under run, occurs if time between two consecutive Advertising packet (in Advertising mode) is lower than the expected value.
0: No error
1: Error occurred </description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IFS_UNDERRUN</name>
	<description>Indicates Inter Frame Space Under run, occurs if IFS time is not enough to update and read Control Structure/Descriptors, and/or White List parsing is not finished and/or Decryption time is too long to be finished on time
0: No error
1: Error occurred </description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>WHITELIST_ERROR</name>
	<description>Indicates White List Timeout error, occurs if White List parsing is not finished on time
0: No error
1: Error occurred</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EVT_CNTL_APFM_ERROR</name>
	<description>Indicates Anticipated Pre-Fetch Mechanism error: happens when 2 consecutive events are programmed, and when the first event is not completely finished while second pre-fetch instant is reached.
0: No error
1: Error occured </description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EVT_SCHDL_APFM_ERROR</name>
	<description>Indicates Anticipated Pre-Fetch Mechanism error: happens when 2 consecutive events are programmed, and when the first event is not completely finished while second pre-fetch instant is reached.
0: No error
1: Error occured </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EVT_SCHDL_ENTRY_ERROR</name>
	<description>Indicates Event Scheduler faced Invalid timing programing on two consecutive ET entries (e.g first one with 624s offset and second one with no offset)
0: No error
1: Error occurred </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EVT_SCHDL_EMACC_ERROR</name>
	<description>Indicates Event Scheduler Exchange Memory access error, happens when Exchange Memory accesses are not served in time, and blocks the Exchange Table entry read
0: No error
1: Error occurred</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RADIO_EMACC_ERROR</name>
	<description>Indicates Radio Controller Exchange Memory access error, happens when Exchange Memory accesses are not served in time and data are corrupted.
0: No error
1: Error occurred </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PKTCNTL_EMACC_ERROR</name>
	<description>Indicates Packet Controller Exchange Memory access error, happens when Exchange Memory accesses are not served in time and Tx/Rx data are corrupted
0: No error
1: Error occurred </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RXCRYPT_ERROR</name>
	<description>Indicates real time decryption error, happens when AES-CCM decryption is too slow compared to Packet Controller requests. A 16-bytes block has to be decrypted prior the next block is received by the Packet Controller
0: No error
1: Error occurred </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TXCRYPT_ERROR</name>
	<description>Indicates Real Time encryption error, happens when AES-CCM encryption is too slow compared to Packet Controller requests. A 16-bytes block has to be encrypted and prepared on Packet Controller request, and needs to be ready before the Packet Controller has to send ti
0: No error
1: Error occurred </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>BLE_FINECNTCORR_REG</name>
	<description>Phase correction value register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>FINECNTCORR</name>
	<description>Phase correction value for the 625us reference counter (i.e. Fine Counter) in us. </description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_FINETIMECNT_REG</name>
	<description>Fine time reference counter</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>FINECNT</name>
	<description>Value of the current s fine time reference counter. Updated each time SAMPCLK is written. Used by the SW in order to synchronize with the HW, and obtain a more precise sleep duration </description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>BLE_FINETIMTGT_REG</name>
	<description>Fine Timer Target value</description>
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x07ffffff</resetMask>
	<fields><field>
	<name>FINETARGET</name>
	<description>Fine Timer Target value on which a ble_finetgtim_irq must be generated. This timer has a precision of 625 usec: interrupt is generated only when FINETARGET = BASETIMECNT </description>
	<bitRange>[26:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_GROSSTIMTGT_REG</name>
	<description>Gross Timer Target value</description>
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields><field>
	<name>GROSSTARGET</name>
	<description>Gross Timer Target value on which a ble_grosstgtim_irq must be generated. This timer has a precision of 10ms: interrupt is generated only when GROSSTARGET[22:0] = BASETIMECNT[26:4] and BASETIMECNT[3:0] = 0. </description>
	<bitRange>[22:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_INTACK_REG</name>
	<description>Interrupt acknowledge register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>SWINTACK</name>
	<description>SW triggered interrupt acknowledgement bit
Software writing 1 acknowledges the SW triggered interrupt. This bit resets SWINTSTAT and SWINTRAWSTAT flags.
Resets at 0 when action is performed </description>
	<bitRange>[9:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>EVENTAPFAINTACK</name>
	<description>End of event / Anticipated Pre-Fetch Abort interrupt acknowledgement bit
Software writing 1 acknowledges the End of event / Anticipated Pre-Fetch Abort interrupt. This bit resets EVENTAPFAINTSTAT and EVENTAPFAINTRAWSTAT flags.
Resets at 0 when action is performed </description>
	<bitRange>[8:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FINETGTIMINTACK</name>
	<description>Fine Target Timer interrupt acknowledgement bit
Software writing 1 acknowledges the Fine Timer interrupt. This bit resets FINETGTIMINTSTAT and FINETGTIMINTRAWSTAT flags.
Resets at 0 when action is performed </description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>GROSSTGTIMINTACK</name>
	<description>Gross Target Timer interrupt acknowledgement bit
Software writing 1 acknowledges the Gross Timer interrupt. This bit resets GROSSTGTIMINTSTAT and GROSSTGTIMINTRAWSTAT flags.
Resets at 0 when action is performed </description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>ERRORINTACK</name>
	<description>Error interrupt acknowledgement bit
Software writing 1 acknowledges the Error interrupt. This bit resets ERRORINTSTAT and ERRORINTRAWSTAT flags.
Resets at 0 when action is performed </description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CRYPTINTACK</name>
	<description>Encryption engine interrupt acknowledgement bit Software writing 1 acknowledges the Encryption engine interrupt. This bit resets CRYPTINTSTAT and CRYPTINTRAWSTAT flags.
Resets at 0 when action is performed </description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>EVENTINTACK</name>
	<description>End of Event interrupt acknowledgment bit
Software writing 1 acknowledges the End of Advertising / Scanning / Connection interrupt. This bit resets SLPINTSTAT and SLPINTRAWSTAT flags.
Resets at 0 when action is performed </description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>SLPINTACK</name>
	<description>End of Deep Sleep interrupt acknowledgment bit
Software writing 1 acknowledges the End of Sleep Mode interrupt. This bit resets SLPINTSTAT and SLPINTRAWSTAT flags.
Resets at 0 when action is performed </description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>RXINTACK</name>
	<description>Packet Reception interrupt acknowledgment bit
Software writing 1 acknowledges the Rx interrupt. This bit resets RXINTSTAT and RXINTRAWSTAT flags.
Resets at 0 when action is performed </description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CSCNTINTACK</name>
	<description>625us base time reference interrupt acknowledgment bit
Software writing 1 acknowledges the CLKN interrupt. This bit resets CLKINTSTAT and CLKINTRAWSTAT flags.
Resets at 0 when action is performed </description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>BLE_INTCNTL_REG</name>
	<description>Interrupt controller register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000811f</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CSCNTDEVMSK</name>
	<description>CSCNT interrupt mask during event. This bit allows to enable CSCNT interrupt generation during events (i.e. advertising, scanning, initiating, and connection)
0: CSCNT Interrupt not generated during events.
1: CSCNT Interrupt generated during events. </description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SWINTMSK</name>
	<description>SW triggered interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EVENTAPFAINTMSK</name>
	<description>End of event / anticipated pre-fetch abort interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FINETGTIMINTMSK</name>
	<description>Fine Target Timer Mask
0: Interrupt not generated
1: Interrupt generated </description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GROSSTGTIMINTMSK</name>
	<description>Gross Target Timer Mask
0: Interrupt not generated
1: Interrupt generated </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ERRORINTMSK</name>
	<description>Error Interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CRYPTINTMSK</name>
	<description>Encryption engine Interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EVENTINTMSK</name>
	<description>End of event Interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SLPINTMSK</name>
	<description>Sleep Mode Interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXINTMSK</name>
	<description>Rx Interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CSCNTINTMSK</name>
	<description>625us Base Time Interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BLE_INTRAWSTAT_REG</name>
	<description>Interrupt raw status register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>SWINTRAWSTAT</name>
	<description>SW triggered interrupt raw status
0: No SW triggered interrupt.
1: A SW triggered interrupt is pending. </description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EVENTAPFAINTRAWSTAT</name>
	<description>End of event / Anticipated Pre-Fetch Abort interrupt raw status
0: No End of Event interrupt.
1: An End of Event interrupt is pending. </description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FINETGTIMINTRAWSTAT</name>
	<description>Fine Target Timer Error interrupt raw status
0: No Fine Target Timer interrupt.
1: A Fine Target Timer interrupt is pending. </description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>GROSSTGTIMINTRAWSTAT</name>
	<description>Gross Target Timer interrupt raw status
0: No Gross Target Timer interrupt.
1: A Gross Target Timer interrupt is pending. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ERRORINTRAWSTAT</name>
	<description>Error interrupt raw status
0: No Error interrupt.
1: An Error interrupt is pending. </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CRYPTINTRAWSTAT</name>
	<description>Encryption engine interrupt raw status
0: No Encryption / Decryption interrupt.
1: An Encryption / Decryption interrupt is pending. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EVENTINTRAWSTAT</name>
	<description>End of Event interrupt raw status
0: No End of Advertising / Scanning / Connection interrupt.
1: An End of Advertising / Scanning / Connection interrupt is pending. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SLPINTRAWSTAT</name>
	<description>Sleep interrupt raw status
0: No End of Sleep Mode interrupt.
1: An End of Sleep Mode interrupt is pending. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RXINTRAWSTAT</name>
	<description>Packet Reception interrupt raw status
0: No Rx interrupt.
1: An Rx interrupt is pending. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CSCNTINTRAWSTAT</name>
	<description>625us base time reference interrupt raw status
0: No 625us Base Time interrupt.
1: A 625us Base Time interrupt is pending. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>BLE_INTSTAT_REG</name>
	<description>Interrupt status register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>SWINTSTAT</name>
	<description>SW triggered interrupt status
0: No SW triggered interrupt.
1: A SW triggered interrupt is pending </description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EVENTAPFAINTSTAT</name>
	<description>End of event / Anticipated Pre-Fetch Abort interrupt status
0: No End of Event interrupt.
1: An End of Event interrupt is pending. </description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FINETGTIMINTSTAT</name>
	<description>Masked Fine Target Timer Error interrupt status
0: No Fine Target Timer interrupt.
1: A Fine Target Timer interrupt is pending. </description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>GROSSTGTIMINTSTAT</name>
	<description>Masked Gross Target Timer interrupt status
0: No Gross Target Timer interrupt.
1: A Gross Target Timer interrupt is pending. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ERRORINTSTAT</name>
	<description>Masked Error interrupt status
0: No Error interrupt.
1: An Error interrupt is pending. </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CRYPTINTSTAT</name>
	<description>Masked Encryption engine interrupt status
0: No Encryption / Decryption interrupt.
1: An Encryption / Decryption interrupt is pending. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EVENTINTSTAT</name>
	<description>Masked End of Event interrupt status
0: No End of Advertising / Scanning / Connection interrupt.
1: An End of Advertising / Scanning / Connection interrupt is pending. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SLPINTSTAT</name>
	<description>Masked Sleep interrupt status
0: No End of Sleep Mode interrupt.
1: An End of Sleep Mode interrupt is pending. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RXINTSTAT</name>
	<description>Masked Packet Reception interrupt status
0: No Rx interrupt.
1: An Rx interrupt is pending. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CSCNTINTSTAT</name>
	<description>Masked 625us base time reference interrupt status
0: No 625us Base Time interrupt.
1: A 625us Base Time interrupt is pending. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>BLE_RADIOCNTL0_REG</name>
	<description>Radio interface control register</description>
	<addressOffset>0x00000070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x7fffffff</resetMask>
	
