dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<addressOffset>0x00000052</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00004000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VBAT_HL_CONNECT_MODE</name>
	<description>Sets the control mode fo the switch between VBAT_HIGH and VBAT_LOW
0: Manual (default)
1: Automatic (boost mode only)</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VBAT_HIGH_HYST_DIS</name>
	<description>0: Hysteresis enabled
1: Hysteresis disabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VBAT_HIGH_HYST_SEL</name>
	<description>0: Low level selected
1: High level selected</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VBAT_HIGH_DISABLE</name>
	<description>Disable por_vbat_high circuit</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VBAT_LOW_HYST_DIS</name>
	<description>0: Hysteresis enabled
1: Hysteresis disabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VBAT_LOW_HYST_SEL</name>
	<description>0: Low level selected
1: High level selected</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VBAT_LOW_DISABLE</name>
	<description>Disable por_vbat_low circuit</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CP_DISABLE</name>
	<description>Disables LDO_CORE charge-pump circuit</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_VREF_HOLD_FORCE</name>
	<description>Forces LDO references in HOLD mode
</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_LOW_CTRL_REG</name>
	<description>00: High-current mode in active, LDO_LOW OFF in sleep
01: LDO_LOW OFF
10: Low-current mode in active, Low-current mode in sleep
11: High-current mode in active, Low-current mode in sleep</description>
	<bitRange>[6:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_CORE_DISABLE</name>
	<description>Disables LDO_CORE</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_CORE_RET_ENABLE</name>
	<description>LDO_CORE_RETENTION
0: Disabled
1: Enabled</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VBAT_HL_CONNECT</name>
	<description>Switch between VBAT_HIGH and VBAT_LOW
0: Open
1: Closed</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMP_VBAT_HIGH_OK_ENABLE</name>
	<description>Enable cmp_vbat_high_ok</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMP_VBAT_HIGH_NOK_ENABLE</name>
	<description>Enable cmp_vbat_high_nok</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>POWER_LEVEL_REG</name>
	
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00001a3e</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>DCDC_TRIM</name>
	<description>Delta from DCDC_LEVEL nominal value
000: -75 mV
001: -50 mV
010: -25 mV
011: 0 (default)
100: +25 mV
101: +50 mV
110: +75 mV
111: +100 mV</description>
	<bitRange>[13:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_LEVEL</name>
	<description>00: 1.1 V
01: 1.8 V (default)
10: 2.5 V
11: 3.0 V</description>
	<bitRange>[10:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_CORE_RET_CUR_TRIM</name>
	<description>00: Default value
01: 2x error amp tail current
10: 2xadaptive bias feedback ratio
11: 2x both tail current and adaptive bias feedback ratio </description>
	<bitRange>[8:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_XTAL_TRIM</name>
	<description>Delta from 0.9 V nominal value
000: -75 mV
001: -50 mV
010: -25 mV
011: 0 (default)
100: +25 mV
101: +50 mV
110: +75 mV
111: +100 mV</description>
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_LOW_TRIM</name>
	<description>Delta from 1.1 V nominal value
000: -75 mV
001: -50 mV
010: -25 mV
011: 0 (default)
100: +25 mV
101: +50 mV
110: +75 mV
111: +100 mV (coldboot)</description>
	<bitRange>[3:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_CORE_LEVEL</name>
	<description>0: 0.9V
1: 1.0V (testmode, do not use)</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RAM_PWR_CTRL_REG</name>
	<description>Control power state of System RAMS</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>RAM3_PWR_CTRL</name>
	<description>See description of RAM1_PWR_CTRL.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM2_PWR_CTRL</name>
	<description>See description of RAM1_PWR_CTRL.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM1_PWR_CTRL</name>
	<description>Power state control of the individual RAMs. May only change when the memory isn't accessed.
When PD_SYS_IS_UP:
0x0: Normal operation
0x1: Normal operation
0x2: Retained (no access possible)
0x3: Off (memory content corrupted)
When PD_MEM_IS_DOWN:
0x0: Retained
0x1: Off (memory content corrupted)
0x2: Retained
0x3: Off (memory content corrupted)</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SYS_CTRL_REG</name>
	<description>System Control register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000020</resetValue>
	<resetMask>0x000087ff</resetMask>
	<fields><field>
	<name>SW_RESET</name>
	<description>Writing a '1' to this bit will reset the device, except for:
SYS_CTRL_REG
CLK_FREQ_TRIM_REG
... </description>
	<bitRange>[15:15]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TIMEOUT_DISABLE</name>
	<description>Disables timeout in Power statemachine. By default, the statemachine continues if after 2 ms the blocks are not started up. This can be read back from
ANA_STATUS_REG. </description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEBUGGER_ENABLE</name>
	<description>Enable the debugger. This bit is set by the booter according to the OTP header. If not set, the SWDIO and SW_CLK can be used as gpio ports.
0x0: no debugger enabled.
0x1: SW_CLK = P0[2], SW_DIO=P0[5]
0x2: SW_CLK = P0[2], SW_DIO=P0[1]
0x3: SW_CLK = P0[2], SW_DIO=P0[10]</description>
	<bitRange>[8:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_RESET_REQ</name>
	<description>Reset request for the OTP controller. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTP_COPY</name>
	<description>Enables OTP to SysRAM copy action after waking up PD_SYS </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_PHASE</name>
	<description>Sets the development phase mode.

If this bit is set, in combination with the OTP_COPY bit, the OTP DMA will emulate the OTP mirroring to System RAM.
No actual writing to RAM is done, but the exact same amount of time is spend as if the mirroring would take place. This is to mimic the behavior as if the System Code is already in OTP, and the mirroring takes place after waking up, but the (development) code still resides in an external source.
If this bit is set to '0' and OTP_COPY='1', then the OTP DMA will actually do the OTP mirroring at wakeup.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>REMAP_ADR0</name>
	<description>Controls which memory is located at address 0x0000 for execution.
0x0: ROM
0x1: OTP
0x2: RAM (SysRAM1)
0x3: RAM (SysRAM3, 28 kBytes offset)
This bitfield only takes affect after a Software Reset.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SYS_STAT_REG</name>
	<description>System status register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000045</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>XTAL32M_SETTLED</name>
	<description>Indicates that XTAL32M has had its settle time, as defined by TRIM_CTRL_REG[XTAL_SETTLE_N]</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_TRIM_READY</name>
	<description>Indicates that XTAL trimming mechanism is ready, i.e. the trimming equals CLK_FREQ_TRIM_REG. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DBG_IS_UP</name>
	<description>Indicates that the SW debugger is attached and in connection with the ARM.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_IS_UP</name>
	<description>Indicates that PD_TIM is functional </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_IS_DOWN</name>
	<description>Indicates that PD_TIM is in power down </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RAD_IS_UP</name>
	<description>Indicates that PD_RAD is functional </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RAD_IS_DOWN</name>
	<description>Indicates that PD_RAD is in power down </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>TRIM_CTRL_REG</name>
	<description>Control trimming of the XTAL32M</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00003f22</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>XTAL_SETTLE_N</name>
	<description>Designates that the XTAL can be safely used as the CPU clock. When XTAL_CLK_CNT reases this value, the signal XTAL32M_SETTLED bit in the SYS_STAT_REG will be set. Counts in steps of 64 xtal clock-cycles.</description>
	<bitRange>[13:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL_TRIM_SELECT</name>
	<description>Select which source controls the XTAL trimming
0b00: xtal counter. Starts CLK_FREQ_TRIM_REG[XTAL32M_START] after COUNT_N * 32 xtal pulses trim is changed to CLK_FREQ_TRIM_REG[XTAL32M_TRIM].
0b01: xtal OK filter. Starts with CLK_FREQ_TRIM_REG[XTAL32M_START], when xtal is ramping is changed to CLK_FREQ_TRIM_REG[XTAL32M_TRIM].
0b10: statically forced off. Only uses CLK_FREQ_TRIM_REG[XTAL32M_TRIM].
0b11: xtal OK filter, 2 stage. Starts with CLK_FREQ_TRIM_REG[XTAL32M_START] switches to CLK_FREQ_TRIM_REG[XTAL32M_RAMP] after timeout (sw1='1', XTAL32M_CTRL0_REG[XTAL32M_SW_DELAY]), and switches to CLK_FREQ_TRIM_REG[XTAL32M_TRIM] when sw2='1'.</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL_COUNT_N</name>
	<description>Defines the number of XTAL cycles to be counted, before the xtal trimming is applied, in steps of 64 cycles.
0x01: 64
0x02: 128
0x3f: 4032</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_CTRL0_REG</name>
	<description>Control bits for XTAL32M</description>
	<addressOffset>0x00000038</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000015</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>XTAL32M_SPARE</name>
	<description>Spare register</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CORE_AMPL_TRIM</name>
	<description>Core amplitude trimming</description>
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CORE_CUR_SET</name>
	<description>Core current trim setting</description>
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CORE_AMPL_REG_NULLBIAS</name>
	<description>Keep bias in ampl detector alive, even when there is a large drive</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCBLOCK_ENABLE</name>
	<description>Enable dcblock/high pass filter circuit</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_START_REG</name>
	<description>Trim values for XTAL32M</description>
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000aa</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>XTAL32M_RAMP</name>
	<description>Xtal frequency trimming register.
0x00 : highest frequency
0xFF :lowest frequency</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_START</name>
	<description>Xtal frequency trimming register.
0x0 = highest frequency
0xF = lowest frequency.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_TRSTAT_REG</name>
	<description>Read back value of current XTAL trimming</description>
	<addressOffset>0x00000032</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>XTAL32M_TRSTAT</name>
	<description>Reads value of the current XTAL trimming</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>XTALRDY_CTRL_REG</name>
	<description>Control register for XTALRDY IRQ</description>
	<addressOffset>0x00000034</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>XTALRDY_CNT</name>
	<description>Number of 32kHz or 256kHz cycles between the crystal is enabled, and the XTALRDY_IRQ is fired. Frequency set by XTALRDY_CLK_SEL.
0x00: no interrupt
</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTALRDY_STAT_REG</name>
	<description>Difference between XTAL_OK and XTALRDY_IRQ in LP clock cycles</description>
	<addressOffset>0x00000036</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>XTALRDY_STAT</name>
	<description>Value of IRQ counter when trimming is switched from RAMP to TRIM</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DCDC</name>
	<version>1.0</version>
	<description>DCDC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000080</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>10</size>
	<usage>registers</usage>
</addressBlock>
	
