dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<registers>
	<register>
	<name>DCDC_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000084a2</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCDC_ILIM_MAX</name>
	<description>Maximum value for automatic inductor peak current limit control.
0x0: 6 mA
0x1: 12 mA
0x2: 18 mA
0x3: 24 mA
0x4: 30 mA
0x5: 36 mA
0x6: 42 mA
0x7: 48 mA
0x8: 54 mA (default, limits inrush current)
0x9: 60 mA
0xA: 66 mA
0xB: 72 mA
0xC: 78 mA
0xD: 84 mA
0xE: 90 mA
0xF: 96 mA (set as default for low-ohmic batteries)</description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_ILIM_MIN</name>
	<description>Minimum value for automatic inductor peak current limit control.
0x0: 6 mA
0x1: 12 mA
0x2: 18 mA
0x3: 24 mA
0x4: 30 mA (default)
0x5: 36 mA
0x6: 42 mA
0x7: 48 mA
0x8: 54 mA
0x9: 60 mA
0xA: 66 mA
0xB: 72 mA
0xC: 78 mA
0xD: 84 mA
0xE: 90 mA
0xF: 96 mA</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_OK_CLR_CNT</name>
	<description>Number of subsequent V_NOK events needed to reset VDCD_OK.
0x0: 2
0x1: 4
0x2: 8 (deafult)
0x3: 15</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_TIMEOUT</name>
	<description>Switch timeout, go to next state if either switch is active for longer than this setting.
0x0: Disabled
0x1: 0.25 ms
0x2: 0.50 ms
0x3: 0.75 ms
0x4: 1.00 ms (default)
0x5: 1.25 ms
0x6: 1.50 ms
0x7: 1.75 ms</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_CLK_DIV</name>
	<description>Idle clock divider, sets rate at which the output is monitored when the converter is idle.
0x0: Divide by 4
0x1: Divide by 8
0x2: Divide by 16
0x3: Divide by 32</description>
	<bitRange>[2:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_ENABLE</name>
	<description>Enables hardware control of the DCDC converter.
0: DCDC converter disabled
1: DCDC converter under hardware control</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_STATUS1_REG</name>
	
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000048</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCDC_FSM_STATE</name>
	<description>State of the analog FSM, only values listed below are valid:
0x0: Idle
0x1: Buck mode, PSW state
0x2: Buck mode, NSW state
0x4: Boost mode, PSW state
0x8: Boost mode, NSW state</description>
	<bitRange>[15:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_SW_STATE</name>
	<description>State of the DCDC switches:
0x0: Both switches open
0x1: P switch closed
0x2: N switch closed
0x3: Unused</description>
	<bitRange>[11:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VOUT_NOK</name>
	<description>NOK signal from output comparator.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VOUT_OK</name>
	<description>OK signal from output comparator.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_ILIM</name>
	<description>Actual inductor peak current limit.</description>
	<bitRange>[7:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_BOOST_MODE</name>
	<description>Indicates that the converter is in boost mode.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_STARTUP_COMPLETE</name>
	<description>Indicates that DCDC converter is enabled and startup delay of 4 ms has passed.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_ENABLED</name>
	<description>Value of the analog enable signal, depends on both register setting and external enable input.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VDCDC_OK</name>
	<description>Becomes high if the output voltage is OK, resets after a programmable number of subsequent NOK events.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DCDC_STATUS2_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>DCDC_COMP_TRIM</name>
	<description>Actual comparator trim value.</description>
	<bitRange>[13:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_TIMEOUT_PSW</name>
	<description>Timeout signal for P switch.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_TIMEOUT_NSW</name>
	<description>Timeout signal for N switch.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_COMP_P_DYN_P</name>
	<description>P Output of P side dynamic comparator.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_COMP_P_DYN_N</name>
	<description>N Output of P side dynamic comparator.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_COMP_P_CONT</name>
	<description>Output of P side continuous time comparator.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_COMP_N_DYN_P</name>
	<description>P Output of N side dynamic comparator.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_COMP_N_DYN_N</name>
	<description>N Output of N side dynamic comparator.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_COMP_N_CONT</name>
	<description>Output of N side continuous time comparator.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DCDC_TEST1_REG</name>
	
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000400</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>DCDC_DIG_TST_SEL</name>
	<description>Controls digital test outputs.
0x0: Disabled (default)
0x1: Lower byte of DCDC_STATUS1_REG
0x2: Upper byte of DCDC_STATUS1_REG
0x3: Lower byte of DCDC_STATUS2_REG
0x4: Upper byte of DCDC_STATUS2_REG
0x5: Reserved
0x6: Reserved
0x7: Reserved</description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_ILIM_VAL</name>
	<description>Value of the inductor peak current limit when manually controlled.</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_COMP_CLK_VAL</name>
	<description>Value of the output comparator clock when manually controlled.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_ILIM</name>
	<description>Enables manual control of the inductor peak current limit.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_COMP_TRIM</name>
	<description>Enables manual control of the comparator trim value.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_COMP_CLK</name>
	<description>Enables manual control of the output comparator clock.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_SW_TST</name>
	<description>Switch test mode:
0x0: Normal mode (default)
0x1: Force P switch
0x2: Force N switch
0x3: Unused</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_TRIG</name>
	<description>Forces a trigger event in the analog FSM.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_IDLE</name>
	<description>Forces the DCDC in idle mode, current conversion is finished first.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_TEST2_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>DCDC_COMP_TRIM_VAL</name>
	<description>Value of the comparator trim setting when manually controlled.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DEM</name>
	<version>1.0</version>
	<description>DEM registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40002000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>112</size>
	<usage>registers</usage>
</addressBlock>
	
