dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<registers>
	<register>
	<name>RF_AFC_CTRL_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000015</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>AFC_SYNCF_DIRECT</name>
	<description>Allow the AFC state to directly transit from IDLE or PREAMBLE detection state to LOCKED state</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>APD_MODE</name>
	<description>Select the mode in the APD FSM:

xx1: Enable the transition from the ADDRESSDETECTION state to the IDLE state when the signal detection is low
x1x: Enable the reset of the AFC filter when the FSM is in the IDLE state
1xx: Enable the time out in the PREAMBLEDETECTION state. The FSM returns to the IDLE state after the time out.</description>
	<bitRange>[8:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PAD_MODE</name>
	<description>The PAD mode in BLE mode

00: No limits
01: Wrapping
10: Saturate to zero
11: 580 legacy mode</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AFC_MODE</name>
	<description>Choose the method to use for AFC tracking during the slot
Description TBD </description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_CTRL1_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0056d50d</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>AGC_MODE</name>
	<description>Choose the method to use for AGC evaluation
Description TBD </description>
	<bitRange>[22:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGC_TH2_HIGH</name>
	<description>AGC treshhold for FASTAGC mode... switch up number of steps defined by FASTAGC_STEPS</description>
	<bitRange>[20:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGC_TH_HIGH</name>
	<description>AGC hysteresis high threshold (switch up one AGC_SETTING_R step when exceeding this level) </description>
	<bitRange>[13:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGC_TH_LOW</name>
	<description>AGC hysteresis low threshold (switch down one AGC_SETTING_R step when dropping below this level) </description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_CTRL2_REG</name>
	
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0040148d</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields><field>
	<name>EN_FRZ_GAIN</name>
	<description>'0': AGC always active
'1': Freeze gain after Access Address detection </description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGCSETTING_WR</name>
	<description>Fixed AGC setting to be used to configure LNA, VGA1 and VGA2 when AGCSETTING_SEL = 1
0: Highest gain as configured in RF_AGC_LUT_01_REG
1: Lower gain as configured in RF_AGC_LUT_01_REG
2: Still lower gain as configured in RF_AGC_LUT_23_REG
...
9-F: Lowest gain as configured in RF_AGC_LUT_89_REG </description>
	<bitRange>[21:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGCSETTING_SEL</name>
	<description>LNA, VGA1 and VGA2 gains
'0': controlled by AGC
'1': provided manually through AGCSETTING_WR </description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGC_MAX_SETTING</name>
	<description>Maximum AGC setting used from AGC LUT</description>
	<bitRange>[12:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGCDEC_WAIT</name>
	<description>Wait time for settling after a single AGC step decrease (increasing gain)

0x0 - 1us
0x1 - 2us
0x2 - 3us
0x3 - 4us

</description>
	<bitRange>[8:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGCINC_WAIT</name>
	<description>Wait time for settling after a single AGC step increase (decreasing gain)

0x0 - 1us
0x1 - 2us
0x2 - 3us
0x3 - 4us
</description>
	<bitRange>[6:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FASTAGC_WAIT</name>
	<description>Wait time for signal settling after fast AGC toggling

0x0 - 1us
0x1 - 2us
0x2 - 3us
0x3 - 4us

</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FASTAGC_STEPS</name>
	<description>Define the number of 6dB steps that is used when the RSSI level
is larger than AGC_TH2_HIGH

0x0 - 1 step
0x1 - 2 steps
0x2 - 3 steps
0x3 - 4 steps

</description>
	<bitRange>[2:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FASTAGC_EN</name>
	<description>Allow the AGC to decrease the gain by multiple steps of 6dB

</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_LUT_0123_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x23030201</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LNA_GAIN3</name>
	<description>LNA gain setting while in AGC setting 3</description>
	<bitRange>[31:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN3</name>
	<description>VGA1 gain setting while in AGC setting 3</description>
	<bitRange>[28:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN3</name>
	<description>VGA2 gain setting while in AGC setting 3</description>
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN2</name>
	<description>LNA gain setting while in AGC setting 2</description>
	<bitRange>[23:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN2</name>
	<description>VGA1 gain setting while in AGC setting 2</description>
	<bitRange>[20:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN2</name>
	<description>VGA2 gain setting while in AGC setting 2</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN1</name>
	<description>LNA gain setting while in AGC setting 1</description>
	<bitRange>[15:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN1</name>
	<description>VGA1 gain setting while in AGC setting 1 </description>
	<bitRange>[12:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN1</name>
	<description>VGA2 gain setting while in AGC setting 1 </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN0</name>
	<description>LNA gain setting while in AGC setting 0 </description>
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN0</name>
	<description>VGA1 gain setting while in AGC setting 0 </description>
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN0</name>
	<description>VGA2 gain setting while in AGC setting 0 </description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_LUT_4567_REG</name>
	
