dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x332f2b27</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LNA_GAIN7</name>
	<description>LNA gain setting while in AGC setting 7</description>
	<bitRange>[31:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN7</name>
	<description>VGA1 gain setting while in AGC setting 7</description>
	<bitRange>[28:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN7</name>
	<description>VGA2 gain setting while in AGC setting 7</description>
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN6</name>
	<description>LNA gain setting while in AGC setting 6</description>
	<bitRange>[23:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN6</name>
	<description>VGA1 gain setting while in AGC setting 6</description>
	<bitRange>[20:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN6</name>
	<description>VGA2 gain setting while in AGC setting 6</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN5</name>
	<description>LNA gain setting while in AGC setting 5</description>
	<bitRange>[15:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN5</name>
	<description>VGA1 gain setting while in AGC setting 5</description>
	<bitRange>[12:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN5</name>
	<description>VGA2 gain setting while in AGC setting 5</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN4</name>
	<description>LNA gain setting while in AGC setting 4</description>
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN4</name>
	<description>VGA1 gain setting while in AGC setting 4</description>
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN4</name>
	<description>VGA2 gain setting while in AGC setting 4</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_LUT_89AB_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x77775737</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LNA_GAIN11</name>
	<description>LNA gain setting while in AGC setting 11</description>
	<bitRange>[31:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN11</name>
	<description>VGA1 gain setting while in AGC setting 11</description>
	<bitRange>[28:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN11</name>
	<description>VGA2 gain setting while in AGC setting 11</description>
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN10</name>
	<description>LNA gain setting while in AGC setting 10</description>
	<bitRange>[23:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN10</name>
	<description>VGA1 Gain setting while in AGC setting 10</description>
	<bitRange>[20:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN10</name>
	<description>VGA2 gain setting while in AGC setting 10</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN9</name>
	<description>LNA gain setting while in AGC setting 9 </description>
	<bitRange>[15:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN9</name>
	<description>VGA1 gain setting while in AGC setting 9 </description>
	<bitRange>[12:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN9</name>
	<description>VGA2 gain setting while in AGC setting 9 </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN8</name>
	<description>LNA gain setting while in AGC setting 8 </description>
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN8</name>
	<description>VGA1 gain setting while in AGC setting 8 </description>
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN8</name>
	<description>VGA2 gain setting while in AGC setting 8 </description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_LUT_CDEF_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x01022243</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LNA_GAIN15</name>
	<description>LNA gain setting while in AGC setting 15</description>
	<bitRange>[31:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN15</name>
	<description>VGA1 gain setting while in AGC setting 15</description>
	<bitRange>[28:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN15</name>
	<description>VGA2 gain setting while in AGC setting 15</description>
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN14</name>
	<description>LNA gain setting while in AGC setting 14</description>
	<bitRange>[23:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN14</name>
	<description>VGA1 Gain setting while in AGC setting 14</description>
	<bitRange>[20:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN14</name>
	<description>VGA2 gain setting while in AGC setting 14</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN13</name>
	<description>LNA gain setting while in AGC setting 13</description>
	<bitRange>[15:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN13</name>
	<description>VGA1 gain setting while in AGC setting 13</description>
	<bitRange>[12:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN13</name>
	<description>VGA2 gain setting while in AGC setting 13</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_GAIN12</name>
	<description>LNA gain setting while in AGC setting 12</description>
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA1_GAIN12</name>
	<description>VGA1 gain setting while in AGC setting 12</description>
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VGA2_GAIN12</name>
	<description>VGA2 gain setting while in AGC setting 12</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_RESULT_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>AGCSETTING_RD</name>
	<description>AGC setting as automatically selected in receive mode to configure LNA, VGA1 and VGA2
0: Highest gain as configured in RF_AGC_LUT_01_REG
1: Lower gain as configured in RF_AGC_LUT_01_REG
2: Still lower gain as configured in RF_AGC_LUT_23_REG
...
9-F: Lowest gain as configured in RF_AGC_LUT_89_REG </description>
	<bitRange>[11:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AFC_RD</name>
	<description>Frequency offset estimation (in 2s complement) with a resolution of approximately 5 kHz. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL1_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00020100</resetValue>
	<resetMask>0x0003fdfe</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_WR</name>
	<description>DC offset compensation value in Q channel valid when DCOFFSET_SEL = 1
In Barium only 8 Bit DAC is used. LSB of 9-bit DAC from D2522 is no longer needed.</description>
	<bitRange>[17:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOFFSET_I_WR</name>
	<description>DC offset compensation value in I channel valid when DCOFFSET_SEL = 1
n Barium only 8 Bit DAC is used. LSB of 9-bit DAC from D2522 is no longer needed.</description>
	<bitRange>[8:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL2_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00f86696</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>DCOC_RESULT_LNAGAIN345_LUT</name>
	<description>DCoffset result used for LNA gain settings 3 4 and 5. </description>
	<bitRange>[23:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOC_RESULT_LNAGAIN2_LUT</name>
	<description>DCoffset result used for LNA gain setting 2</description>
	<bitRange>[21:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOC_RESULT_LNAGAIN1_LUT</name>
	<description>DCoffset result used for LNA gain setting 1</description>
	<bitRange>[19:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOC_RESULT_LNAGAIN0_LUT</name>
	<description>DCoffset result used for LNA gain setting 0</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCPAR_DCF_EN</name>
	<description>Use a DCF to start the partial DC offset calibration.
</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCPAR_MULT_STEPS_EN</name>
	<description>Enable the partial DCOC calibration with multiple gain settings.
When not set, the partial calibration is the same as in 680BA.

</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCPARNGAIN</name>
	<description>Number of gain settings for the partial DC offset calibration</description>
	<bitRange>[13:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCVGA1SCALE_EN</name>
	<description>Enable the DC offset scaling with the VGA1 gain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCPARCAL_INIT</name>
	<description>Select the inital value used for the partial DC offset calibration.

