dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
0: The DC offset from the previous packet
1: The DC offset found with the full DC offset calibration
2: Start from the mid value. </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCFULLNGAIN</name>
	<description>Number of gain settings for the full DC offset calibration </description>
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCNSTEP</name>
	<description>Number of the steps per.gain setting for the full or partial DC offset calibrations </description>
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCPARCAL_EN</name>
	<description>Enable flag for the partial DC offset calibration The calbration is executed when the demodulator is enabled. 
When the bit DCPAR_DCF_EN is set, the enabling is started by the DCF. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOFFSET_SEL</name>
	<description>'0': Normal operation
'1': Use the manual DC offset compensation values from RF_DC_OFFSET_CTRL1_REG </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL3_REG</name>
	
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000dce4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCBETA_Q</name>
	<description>Quadrature feedback gain for the DC offset calibration

Value for DCBETA depends on the IFF DCOC REF CURR
setting, ratio_580_refcurr, preferred_settingRF_DC_OFFSET_CTRL3_REG
0, 1x, 0xDCE4
1, 2x, 0xEEF2
2, 3x, 0xF4F7
3, 4x, 0xF7F9






</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCBETA_I</name>
	<description>Inphase feedback gain for the DC offset calibration

Value for DCBETA depends on the IFF DCOC REF CURR
setting, ratio_580_refcurr, preferred_settingRF_DC_OFFSET_CTRL3_REG
0, 1x, 0xDCE4
1, 2x, 0xEEF2
2, 3x, 0xF4F7
3, 4x, 0xF7F9</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL4_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00009210</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCAGCSETTING_FULL3</name>
	<description>AGC setting for forth last the gain step for the full DC offset calibration </description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCAGCSETTING_FULL2</name>
	<description>AGC setting for third last the gain step for the full DC offset calibration </description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCAGCSETTING_FULL1</name>
	<description>AGC setting for second last the gain step for the full DC offset calibration </description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCAGCSETTING_FULL0</name>
	<description>AGC setting for last the gain step for the full DC offset calibration </description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_FULL_RES_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_RD</name>
	<description>Stored DC offset FULL calibration result value of the Q channel. </description>
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>Stored DC offset FULL calibration result value of the Q channel. </description>
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_MPAR_RES0_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_RD</name>
	<description>DC offset calibration result value of the last step of the multiple partial calibration. (Q channel) </description>
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>DC offset calibration result value of the last step of the multiple partial calibration. (I channel) </description>
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_MPAR_RES1_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_RD</name>
	<description>DC offset calibration result value of the (last step -1) of the multiple partial calibration. (Q channel) </description>
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>DC offset calibration result value of the (last step -1) of the multiple partial calibration. (I channel) </description>
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_MPAR_RES2_REG</name>
	
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_RD</name>
	<description>DC offset calibration result value of the (last step -2) of the multiple partial calibration. (Q channel) </description>
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>DC offset calibration result value of the (last step-2) of the multiple partial calibration. (I channel) </description>
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_MPAR_RES3_REG</name>
	
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_RD</name>
	<description>DC offset calibration result value of the (last step -3) of the multiple partial calibration. (Q channel) </description>
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>DC offset calibration result value of the (last step-3) of the multiple partial calibration. (I channel) </description>
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DC_OFFSET_RESULT_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>DCOFFSET_Q_RD</name>
	<description>DC offset compensation value in Q channel valid when DCOFFSET_SEL = 0</description>
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>DC offset compensation value in I channel valid when DCOFFSET_SEL = 0. </description>
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_DEM_ATTR_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00c4a18f</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>ADDR_TIMEOUT_X2</name>
	<description>Program the Address Time Out when AFC is in MAC ADDRESS correlation state

