dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
0x0 - short time (32us in 2Mbit mode and 64us in 1Mbit mode)
0x1 - long time (64us in 2Mbit mode and 128us in 1Mbit mode)

</description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFADC_CLK_PHASE</name>
	<description>Select the phase of the RFADC clock</description>
	<bitRange>[23:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RSSI_TH</name>
	<description>RSSI threshold for the packet detection </description>
	<bitRange>[20:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCPOLE</name>
	<description>Set the frequency of the DC offset highpass filter.

The frequency is different when the demodulator is used with 8MHz or 16MHz clock. 

For 8MHz clock:

0x0 - 100kHz
0x1 - 50kHz
0x2 - 150kHz
0x3 - N/A </description>
	<bitRange>[14:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOC_SPEED8M_EN</name>
	<description>Set the preferred Clock Speed for the DC Offset Block </description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGC_SPEED8M_EN</name>
	<description>Set the preferred clock speed for the AGC block</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MATCH0101_TH</name>
	<description>Threshold for the 0101 pattern matching </description>
	<bitRange>[9:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEM_HSI_POL</name>
	<description>Invert &quot;frequency&quot; polarity of the demodulator </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXDATA_INV</name>
	<description>'0': Normal operation
'1': Invert the polarity of the received bits</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AFC_POLE2</name>
	<description>
Set the frequency of the AFC pole (Highpass filter) that is used before and after preamble detection.
The absolute frequency is different for 1Mbit and 2Mbit mode.

3dB cut off frequency in 1Mbit mode.

0 - NA
1 - 78Hz
2 - 156Hz
3 - 311Hz

In 2Mbit mode, the frequency doubles.

</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AFC_POLE1</name>
	<description>
Set the frequency of the AFC pole (Highpass filter) that is used during preamble detection.
The absolute frequency is different for 1Mbit and 2Mbit mode.

3dB cut off frequency in 1Mbit mode.

0 - NA
1 - 1.3kHz
2 - 2.5kHz
3 - 5.1kHz

In 2Mbit mode, the frequency doubles.


</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DEM_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>IQ_TO_GPIO_EN</name>
	<description>Enable the IQ data output for exposed radio mode. </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AGC_USE_GPIO_IN</name>
	<description>Select to use the GPIO input as AGC setting.
To be used with FPGA platform
</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IQCORR_EN</name>
	<description>Enable the IQ mismatch correction

The correction coefficients are define in the RF_DEM_IQCORRECT_REG register</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLE_DDC_EN</name>
	<description>Enable the digital conversion in BLE mode</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EQUAL_EN</name>
	<description>Enable the equalizer in the demodulator </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DEM_IQCORRECT_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>IQCORR_ALPHA</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IQCORR_BETA</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DEM_TESTMODE_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>DEM_RFMON_TRIGGER</name>
	<description>Selects the trigger of the acquisition:

0: DEM_EN
1: Signal detected
2: Set with the rising edge of DEM_EN and reset with the rising edge of SYNC_FOUND_P
3: Set with the rising edge of SYNC_FOUND_P and reset with the falling edge of DEM_EN

Note:
Triggering is guaranteed for the DEM-only test modes. For GPADC and ADPLL and mixes of the 3 (DEM-GPADC-ADPLL) it is TBD.

Note:
Please check bug2522A_018 (DEM 16Msps data need 16MHz RFCU clock).
Also check bug2522A_019 (ADPLL RFMON metastability issue. Need to run with xtal32M to be safe, and use correct setting for polarity inversion bit)</description>
	<bitRange>[8:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEM_GPADC_MUX_SEL</name>
	<description>Selects the combination of DEM test data and GPADC test data, according to the mapping below:

0: {0000000000000000, gpadc_data[15:0]}
1: {0000000000000000, gpadc_data[15:0]}
2: {0000000000000000, dem_data[15:0]}
3: {0000000000000000, dem_data[31:16]}
4: {dem_data[31:16], gpadc_data[15:0]}
5: {dem_data[15:0], gpadc_data[15:0]}
6: dem_data
7: {dem_data[15:0], dem_data[31:16]}

Note:
You need to enable the GPADC in order to see GPADC test data.

Note:
Please check bug2522A_018 (DEM 16Msps data need 16MHz RFCU clock).
Also check bug2522A_019 (ADPLL RFMON metastability issue. Need to run with xtal32M to be safe, and use correct setting for polarity inversion bit)</description>
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEM_RFMON_SOURCE</name>
	<description>Selects the data mapped on the testbus (see demodulator documentation for details).

0: disabled (default)
1: testbus_data := adcout_i(8 downto 1) &amp; adcout_q(8 downto 1)&amp; '0' &amp; ble_rxdata &amp; hpf_output &amp; pad_output;testbus_dem_en &lt;= testbus_trig;
2:testbus_data := dnmin &amp; dpmin &amp; '0' &amp; ble_rxdata &amp; hpf_output &amp; pad_output;testbus_dem_en &lt;= testbus_trig;
3:testbus_data := adcout_i &amp; adcout_q &amp; agc_setting &amp; vga3_out_i &amp; vga3_out_q;testbus_dem_en &lt;= testbus_trig;
4:testbus_data := &quot;00000000000&quot; &amp; rssi_raw &amp; agc_setting &amp; envelope;testbus_dem_en &lt;= testbus_trig;
5:testbus_data := &quot;0000&quot; &amp; demin_q_acc &amp; &quot;0000&quot; &amp; demin_i_acc;testbus_dem_en &lt;= dcoffsetcal_en;
6:testbus_data := &quot;00&quot; &amp; ble_rxdata &amp; agc_setting &amp; adcout_i &amp; envelope &amp; adcout_q ;testbus_dem_en &lt;= testbus_trig;
7:testbus_data := adcout_i(8 downto 1) &amp; adcout_q(8 downto 1) &amp; apd_state &amp; hpf_output &amp; pad_output; testbus_dem_en &lt;= testbus_trig;
8:testbus_data := adcout_i_prev(8 downto 1) &amp; adcout_qprev(8 downto 1) &amp; adcout_i_now(8 downto 1)
&amp; adcout_q_now(8 downto 1) ; testbus_dem_en &lt;= test_bus_trig @ 4MHz
9 ..., 15: reserved

