dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
CP (ANA_TEST_OUT_SEL=0x040), 1-hot decoder (1 bit)
0x0: vcharge_out
0x1: vcp (make sure VBAT_HIGH &gt;2x VBAT_LOW)

Die Temp (ANA_TEST_OUT_SEL=0x080), direct selection
0xX: vptat

XTAL32MHz (ANA_TEST_OUT_SEL=0x100), direct selection
0xX: ldo_xtal_vout
note: more xtal testmodes in xtal ctrl registers

GPADC (ANA_TEST_OUT_SEL=0x200), direct selection
0xX: ldo_gpadc_vout</description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ANA_TEST_OUT_TO_PIN</name>
	<description>0: Testbus internal use (GPADC)
1: Testbus connected to P0_3. The direction of P0_3 pad automatically switches to Input with PU/PD resistors disabled and input enable (ie) also disabled, when this bit-field is set to '1'.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ANA_TEST_OUT_SEL</name>
	<description>Select block to connect to analog testbus (not mutually exlusive)
0x000: High-Z
0x001: Testbus to ground
0x002: Bandgap
0x004: WUP
0x008: DCDC
0x010: LDO_CORE
0x020: LDO_LOW
0x040: CP
0x080: Die Temp
0x100: XTAL32MHz
0x200: GPADC</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TEST_CTRL3_REG</name>
	<description>Test Control Register 3</description>
	<addressOffset>0x00000034</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RF_TEST_OUT_TO_PIN</name>
	<description>0: Radio output testbus internal use
1: Radio output testbus connected to P0_1 and P0_3. The direction of P0_1 and P0_3 pads automatically switches to Input with PU/PD resistors disabled and input enable (ie) also disabled, when this bit-field is set to '1'.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_TEST_OUT_PARAM</name>
	<description>Select which test will be enabled on the block selected by the RF output testbus
RF_TEST_OUT_SEL = 2 radio ldo tests
RF_TEST_OUT_PARAM&lt;3:0&gt; test_out_a&lt;1&gt; test_out_a&lt;0&gt;
xx00                                      High-Z            High-Z
xx01                                      High-Z            ldo_radio_pssrr_cap
xx10                                      ldo_radio out  High-Z
xx11                                      ldo_radio out  ldo_radio_pssrr_cap

RF_TEST_OUT_SEL = 4 IFF output tests
RF_TEST_OUT_PARAM&lt;3:0&gt; test_out_a&lt;1&gt; test_out_a&lt;0&gt;
x000 vga2_out_in_a vga2_out_ip_a
x001 vga2_out_qn_a vga2_out_qp_a
x010 vga1_out_in_a vga1_out_ip_a
x011 vga1_out_qn_a vga1_out_qp_a
x100 vga1_out_qn_a vga1_out_ip_a
x101 vga2_out_qn_a vga2_out_ip_a
x110 High-Z amp_vcmref_a
x111 tes_in_a&lt;0&gt; High-Z

RF_TEST_OUT_SEL = 8 TIA output tests
RF_TEST_OUT_PARAM&lt;3:0&gt; test_out_a&lt;1&gt; test_out_a&lt;0&gt;
xx00 mixout_ip_a mixout_in_a
xx01 mixout_qp_a mixout_qn_a
xx1x High-Z vcm_tia

RF_TEST_OUT_SEL = 16 ADPLL/ldo test
RF_TEST_OUT_PARAM&lt;3:0&gt; test_out_a&lt;1&gt; test_out_a&lt;0&gt;
000x High-Z
001x pwrp_dco_a
010x pwrp_tdc_a
011x High-Z
100x High-Z
101x tb_out_dco_a
110x vref1_a
111x tst_tdc_out_c
0011 pwrn_dco_a
0101 pwrn_tdc_a

Note: above table might need to be cross-checked and updated.</description>
	<bitRange>[12:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ENABLE_RFPT</name>
	<description>0: normal port function
1: enables the RF Production Test Unit. Used to store RX ADC samples or PLL TDC samples in SRAM.
See RFPT_CTRL_REG, RFPT_ADDR_REG and RFPT_LEN_REG for details.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_TEST_OUT_SEL</name>
	<description>Select a radio block to have its testbus connected to P0[1] and P0[3]. See RF_TEST_OUT_PARAM for more information.
NOTE: all 0 represent no testmode and the testbusses are floating in this mode except in reset state the testbuses are pulled to ground.
RF_TEST_OUT_SEL=000001: short test_out_a&lt;1:0&gt; to ground
RF_TEST_OUT_SEL=000010: test radio ldo
RF_TEST_OUT_SEL=000100: test IFF
RF_TEST_OUT_SEL=001000: test MIX
RF_TEST_OUT_SEL=010000: test ADPLL
</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TEST_CTRL4_REG</name>
	<description>Test Control Register 4</description>
	<addressOffset>0x00000036</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RF_TEST_IN_TO_PIN</name>
	<description>0: Radio input testbus internal use
1: Radio input testbus connected to P0_2 and P0_4. The direction of P0_2 and P0_4 pads automatically switches to Input with PU/PD resistors disabled and input enable (ie) also disabled, when this bit-field is set to '1'.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_TEST_IN_PARAM</name>
	<description>Selects which test will be enabled on the block selected by the RF input testbus.
RF_TEST_IN_SEL = 2
RF_TEST_IN_PARAM&lt;3:0&gt;   test_in_a&lt;1&gt;   test_in_a&lt;0&gt;    Condition
xxx0                                     adcinp_i_a     adcinn_i_a        adc_mute=0
xxx1                                     adcinp_q_a    adcinn_q_a      adc_mute=0

RF_TEST_IN_SEL = 4
RF_TEST_IN_PARAM&lt;3:0&gt;   test_in_a&lt;1&gt;      test_in_a&lt;0&gt;
x000                                     vga1_in_in_a     vga1_in_ip_a
x001                                     vga1_in_qn_a    vga1_in_qp_a
x010                                     vga2_in_in_a     vga2_in_ip_a
x011                                     vga2_in_qn_a    vga2_in_qp_a
x100                                     vga1_in_qn_a    vga1_in_ip_a
x101                                     vga2_in_qn_a    vga2_in_ip_a
other                                    High-Z               High-Z
</description>
	<bitRange>[12:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_TEST_IN_SEL</name>
	<description>Select an RF block to have its test input connected to the input testbus at pins P0[2] and P0[4]. NOTE: all 0 represent no testmode and the testbusses are floating except in reset state the testbuses are pulled to ground..
RF_TEST_IN_SEL=0001 : short test_in_a&lt;1:0&gt; to ground
RF_TEST_IN_SEL=0010 : test ADC inputs (details in RF_TEST_IN_PARAM)
RF_TEST_IN_SEL=0100 : test IFF inputs (details in RF_TEST_IN_PARAM) </description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TEST_CTRL_REG</name>
	<description>Test Control Register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>ADPLL_SCAN_COMP_EN</name>
	<description>0: Normal operation
1: Enables the ADPLL scan compression mode.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLL_SCAN_TEST_EN</name>
	<description>0: Normal operation
1: Enables the ADPLL scan test mode.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CP_CAP_BIAS_TRIM</name>
	<description>Charge pump current source setting going to the LDO boost caps.
00: 10 nA (default)
01: 20 nA
10: 5 nA
11: 3.3 nA</description>
	<bitRange>[10:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_CORE_DUMMY_LOAD_ENABLE</name>
	<description>Static load on VDD.
NOTE: function inverted! (to improve default power up behaviour)
0: 5 uA
1: off</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_CORE_CAP_BYPASS</name>
	<description>Option to bypass LDO_CORE boost cap.
0: Normal functionality of boost cap.
1: Bypass boost cap (use it only when VBAT_LOW &gt; 2.2 V).</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CAP_TEST_EN</name>
	<description>0: Normal Port function.
1: Shows xtal32m_cap_test_out output onto P0_1.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SHOW_DCDC</name>
	<description>0: Normal operation
1: The 8-bit DCDC test diagnostics signal is mapped to pins P0_8-P0_3 (bits [7:2]), P0_1 (bit [1]) and P0_0 (bit [0]).
Note: The selection of the specific diagnostic signals is peformed via DCDC_TEST1_REG[DCDC_DIG_TST_SEL] (see also the relative register description, defined under 'crg2632_dcdc_dig_00' sub-module of 'crg2632_00' block).</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SHOW_POWER</name>
	<description>0: Normal operation
1: The following diagnostic signals are mapped to the pins of P0 port:
    P0_0 : CMP_VBAT_HIGH_NOK
    P0_1 : CMP_VBAT_HIGH_OK
    P0_3 : BGR_OK (BANDGAP OK signal)
    P0_4 : POR_VBAT_LOW_N
    P0_5 : POR_VBAT_HIGH_N
    P0_6 : LDO_LOW_OK
    P0_7 : LDO_CORE_OK
    P0_8 : ADC_LDO_OK
    P0_9 : XTAL32M_LDO_OK
</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SHOW_CLOCKS</name>
	<description>0: normal port function
1: P0_1 = SYS_CLK (can be either RC32M, XTAL32M or LP_CLK)
    P0_3 = LP_CLK (can be either XTAL32K, RC32K or RCX)
    P0_4 = RC32K</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_TESTCTRL0_REG</name>
	<description>XTAL32M Test Control Register 0</description>
	<addressOffset>0x00000038</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00003400</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>BIAS_SAH_HOLD_OVERRIDE</name>
	<description>The specific test mode overrules the XTAL bias sampling, as follows:
00 : Normal function (following radio enable)
01 : Continues tracking.
1x : Sample and hold.</description>
	<bitRange>[15:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CORE_FREQ_TRIM_SW2_AMP</name>
	<description>Sets the threshold for the amplitude control OK detection.</description>
	<bitRange>[13:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CORE_GM_CURRENT</name>
	<description>Enables the biasing of main oscillator output device.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CORE_HOLD_AMP_REG_OVERRIDE</name>
	<description>The specific test mode overrules the amplitude detector.
00 : normal function (following radio enable)
01 : Continues tracking.
1x : HOLD mode.</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CORE_I2V_TO_TESTBUS</name>
	<description>The specific test mode enables the core amplifier.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CORE_I2V_TO_TESTBUS_10X</name>
	<description>Test mode increasing the gain of the core amplifier.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CORE_MAX_CURRENT</name>
	<description>Forces the maximum current in output gm core device.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CORE_XTAL_DISCHARGE</name>
	<description>Software control mode, discharges the crystal.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCBLOCK_LV_MODE</name>
	<description>Low voltage comparator test mode</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIFFBUF_BYPASS</name>
	<description>Bypass comparator to use external input</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OSC_TRIM_OPEN_DISABLE</name>
	<description>Varicap testmode, feedback resistors are disabled.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPIKE_FLT_DISABLE</name>
	<description>Disables DXTAL spike filter</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_TESTCTRL1_REG</name>
	<description>XTAL32M Test Control Register 1</description>
	<addressOffset>0x0000003a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>OSC_TRIM_CAP_BIAS</name>
	<description>0: Varicap bottom plate open.
1: Connect varicap bottom-plate to top plate.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFCLK_SEL_ADPLL_ADC_TO_GPIO</name>
	<description>0: Select test output adpll to gpio when rfclk_adpll_to_gpio = 1.
1: Select test output adc to gpio when rfclk_adc_to_gpio = 1.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFCLK_ADC_TO_GPIO</name>
	<description>Enables the test output of rfclk_adc to GPIO along with rfclk_sel_adc_adpll_to_gpio</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFCLK_ADPLL_TO_GPIO</name>
	<description>Enables the test output of rfclk_adpll to GPIO, along with rfclk_sel_adc_adpll_to_gpio</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PROG_VREF_SEL</name>
	<description>Enables the selection of programmable Vref for the XTAL32M LDO.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VARICAP_TEST_SEL_XTAL</name>
	<description>Selects XTAL_P or XTAL_N to varicap test output</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VARICAP_TEST_ENABLE</name>
	<description>Enables varicap test output to DCORE</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_VREF_HOLD_OVERRIDE</name>
	<description>Overrides ldo_vref_hold. Writing a '1' will force a '0' to ldo_vref_hold.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DISABLE_TM_CLK</name>
	<description>This test mode disables tm_clk to enable the testing of the XTAL32M block.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GPREG</name>
	<version>1.0</version>
	<description>GPREG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003300</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>14</size>
	<usage>registers</usage>
</addressBlock>
	
