dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<registers>
	<register>
	<name>PATCH_ADDR0_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR10_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR11_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR12_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR13_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000088</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR14_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR15_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR16_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR17_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR18_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x000000b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR19_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR1_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR20_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_D</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs, the reading data bus willl be replaced by the value of the corresponding PATCH_DATAx_REG.</description>
	<bitRange>[17:2]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR21_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x000000c8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_D</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs, the reading data bus willl be replaced by the value of the corresponding PATCH_DATAx_REG.</description>
	<bitRange>[17:2]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR2_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR3_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR4_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR5_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR6_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR7_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR8_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR9_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	<description>Address bit 19 (refer to the remaining register bitfields).</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_DATA20_REG</name>
	<description>Patch Data field</description>
	<addressOffset>0x000000c4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_DATA</name>
	<description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_DATA21_REG</name>
	<description>Patch Data field</description>
	<addressOffset>0x000000cc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_DATA</name>
	<description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_VALID_REG</name>
	<description>Validity Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_VALID</name>
	<description>Indicates which patch entry is valid. For example, when bit x is high it indicates that entry x is valid, i.e. the values of PATCH_ADDRx_REG / PATCH_DATAx_REG, are effective.
CAUTION: You should not activate two entries where the difference of the corresponding PATCH_ADDRx_REG is less than 12 bytes.</description>
	<bitRange>[21:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>QUADEC</name>
	<version>1.0</version>
	<description>QUADEC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000200</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>14</size>
	<usage>registers</usage>
</addressBlock>
	
