dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<registers>
	<register>
	<name>RF_ADCI_DC_OFFSET_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00020100</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>ADC_OFFN_I_RD</name>
	<description>DC offset compensation in the I path (inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADC_OFFP_I_RD</name>
	<description>DC offset compensation in the I path (non-inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_ADCQ_DC_OFFSET_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00020100</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>ADC_OFFN_Q_RD</name>
	<description>DC offset compensation in the Q path (inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADC_OFFP_Q_RD</name>
	<description>DC offset compensation in the Q path (non-inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_ADC_CTRL1_REG</name>
	<description>ADC control register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00006001</resetMask>
	<fields><field>
	<name>ADC_SIGN</name>
	<description>Change polarity of ADC input. </description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_MUTE</name>
	<description>0: Normal operation
1: Short the inputs of the ADC (used for DC offset cal) </description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_DC_OFFSET_SEL</name>
	<description>0: Normal operation (i.e. Use automatically calibrated value)
1: Use ADC_OFFx_y_WR to set the DC offset compensation values in the ADC (x = N or P, y = I or Q </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ADC_CTRL2_REG</name>
	<description>ADC control register</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>ADC_OFFN_I_WR</name>
	<description>External value for the DC offset compensation in the I path negative side. With common mode input voltage at Vpwrp/2, this value is 512-ADC_OFFP_Q_WR. </description>
	<bitRange>[17:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_OFFP_I_WR</name>
	<description>External value for the DC offset compensation in the I path positive side. </description>
	<bitRange>[8:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ADC_CTRL3_REG</name>
	<description>ADC control register</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>ADC_OFFN_Q_WR</name>
	<description>External value for the DC offset compensation in the Q path negative side. With common mode input voltage at Vpwrp/2, this value is 512-ADC_OFFP_Q_WR. </description>
	<bitRange>[17:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_OFFP_Q_WR</name>
	<description>External value for the DC offset compensation in the Q path positive side. </description>
	<bitRange>[8:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ADPLLDIG_CTRL_REG</name>
	<description>Adplldig specific settings register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x00000073</resetMask>
	<fields><field>
	<name>PWR_SW_TIM_CTRL</name>
	<description>Delay between power switch enable1,2 and status signal: Select any value between 1 to 8 us</description>
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OPENLOOP_RDY_WR</name>
	<description>Overrule value for the openloop_rdy.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OPENLOOP_RDY_SEL</name>
	<description>Overrule the openloop_rdy from adplldig.
0: Normal function (default)
1: Overrule the openloop_rdy by OPENLOOP_RDY_WR</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ADPLLDIG_RFMON_CTRL_REG</name>
	<description>Settings for the ADPLLDIG RFMON block</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>ADPLLDIG_RFMON_SPARE</name>
	
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_RFMON_MUX_SEL</name>
	<description>Mux select for the RFMON data
'b00x: dem_rfmon_data[31:0]
'b010: {dem_rfmon_data[31:16], adplldig_rfmon_data[15:0]}
'b011: {dem_rfmon_data[31:16], adplldig_rfmon_data[31:16]}
'b100: {adplldig_rfmon_data[31:16], dem_rfmon_data[15:0]}
'b101: {adplldig_rfmon_data[15:0], dem_rfmon_data[15:0]}
'b110: adplldig_rfmon_data
'b111: {adplldig_rfmon_data[15:0], adplldig_rfmon_data[31:16]}


Note:
- Please check bug2522A_018 (DEM 16Msps data need 16MHz RFCU clock).
- If only dem_rfmon_data[31:0] is to be monitored by writing 'b000 or 'b001, first the adplldig RFMON data should be disabled by setting ADPLL_RFPT_CTRL_REG[RFPT_MUX] to 0.</description>
	<bitRange>[3:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_SYNC_CLK_INV</name>
	<description>Invert the clock capturing adplldig_rfmon data
0: Do not invert
1: Invert (default)

