dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
Note:
Please check bug2522A_018 (DEM 16Msps data need 16MHz RFCU clock).</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_EXT_LUT_REG</name>
	<description>AGC_LUT register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>AGC_EXT_LUT</name>
	<description>LUT for the AGC value, to be selected by dem_agc from the demodulator.
Gain settings 10, 11, 12 (so the last 3) use the value of gain setting 9</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ATTR_REG</name>
	<description>Radio attributes register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0c000820</resetValue>
	<resetMask>0x0f001f28</resetMask>
	<fields><field>
	<name>PA_POWER_SETTING</name>
	<description>Dynamic setting to control the PA power by enabling units
1 : minimum power

15: maximum power

IMPORTANT:
When the PA Pout ramping is enabled, this setting does NOT affect the Pout after the ramping has finished.
So, in evaluation, in order to sweep the Pout,
either disable the ramping (see RF_PA_CTRL_REG) and then sweep the PA_POWER_SETTING, or if you also want to monitor the ramping then first set the desired value to PA_POWER_SETTING and then enable the TX (repeat this cycle for every PA_POWER_SETTING to be measured). </description>
	<bitRange>[27:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIA_BIAS</name>
	<description>Tuning of the TIA bias current.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_BIAS</name>
	<description>Tuning of the Mixer bias current.</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IFF_POLARITY</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CALSTATE_REG</name>
	<description>cal_state read-out register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CALSTATE</name>
	<description>Value of the calstate state machine </description>
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_CAL_CTRL_REG</name>
	<description>Calibration FSM control</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000017</resetMask>
	<fields><field>
	<name>DC_OFFSET_CAL_DIS</name>
	<description>Do not calibrate the VGA2 Offset during Cal cycle </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_CAL_CTRL_SPARE</name>
	<description>End of calibration trigger.
Reading returns the eo_cal status signal which can be cleared by writing to RF_IRQ_CTRL_REG.EO_CAL_CLEAR </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EO_CAL</name>
	<description>End of calibration trigger.
Reading returns the eo_cal status signal which can be cleared by writing to RF_IRQ_CTRL_REG.EO_CAL_CLEAR </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SO_CAL</name>
	<description>Start of calibration trigger.Writing a 1 starts calibration.1Reading returns the calibration status (1 = busy calibrating). </description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>RF_DIAGIRQ_CTRL_REG</name>
	<description>Control register for Diag IRQ</description>
	<addressOffset>0x000000b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7f7f7f7f</resetMask>
	<fields><field>
	<name>DIAG_BUS3_EDGE_SEL</name>
	<description>0 = rising edge
1 = falling edge</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS3_BIT_SEL</name>
	<description>Bit [0 to 7] selection in DIAG_BUS3</description>
	<bitRange>[29:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS3_SEL</name>
	<description>0 = BLE DIAG0
1 = BLEDIAG1
2 = RFCU DIAG
3 = DEMOD DIAG</description>
	<bitRange>[26:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS3_IRQ_MASK</name>
	<description>Enable diag_bus3 for IRQ generation</description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS2_EDGE_SEL</name>
	<description>0 = rising edge
1 = falling edge</description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS2_BIT_SEL</name>
	<description>Bit [0 to 7] selection in DIAG_BUS2</description>
	<bitRange>[21:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS2_SEL</name>
	<description>0 = BLE DIAG0
1 = BLEDIAG1
2 = RFCU DIAG
3 = DEMOD DIAG</description>
	<bitRange>[18:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS2_IRQ_MASK</name>
	<description>Enable diag_bus 2 for IRQ generation</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS1_EDGE_SEL</name>
	<description>0 = rising edge
1 = falling edge</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS1_BIT_SEL</name>
	<description>Bit [0 to 7] selection in DIAG_BUS1</description>
	<bitRange>[13:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS1_SEL</name>
	<description>0 = BLE DIAG0
1 = BLEDIAG1
2 = RFCU DIAG
3 = DEMOD DIAG</description>
	<bitRange>[10:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS1_IRQ_MASK</name>
	<description>Enable diag_bus 1 for IRQ generation</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS0_EDGE_SEL</name>
	<description>0 = rising edge
1 = falling edge</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS0_BIT_SEL</name>
	<description>Bit [0 to 7] selection in DIAG_BUS0</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS0_SEL</name>
	<description>0 = BLE DIAG0
1 = BLEDIAG1
2 = RFCU DIAG
3 = DEMOD DIAG</description>
	<bitRange>[2:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS0_IRQ_MASK</name>
	<description>Enable diag_bus 0 for IRQ generation</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DIAGIRQ_STAT_REG</name>
	<description>RF DIAG IRQ Status register</description>
	<addressOffset>0x000000b4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>DIAGIRQ_STAT</name>
	<description>RF DIAG IRQ status register</description>
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_IFF_CTRL_REG</name>
	<description>IFF control register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x00007ff3</resetMask>
	<fields><field>
	<name>IFF_DCOC_DAC_REFCUR_CTRL</name>
	<description>Controls the DCOC DAC refcurrent and thus the range of correctable dc offsets at the input of IFF.
Higher value means higher DC offsets can be compensated, but at the same time the LSB (so residual DC offset) increases.
DCOC DAC is 8 bits in D2632

0: 1x current (ibias 2.5uA), +-24mV input offset range
1: 2x current (ibias 5.0uA), +-48mV input offset range (Default)
2: 3x current (ibias 7.5uA), +-72mV input offset range
3: 4x current (ibias 10.0uA), +-96mV input offset range


Value for DCBETA depends on the IFF DCOC DAC REF CURR
setting, ratio_580_refcurr, preferred_settingRF_DC_OFFSET_CTRL3_REG
0, 1x, 0xDCE4
1, 2x, 0xEEF2
2, 3x, 0xF4F7
3, 4x, 0xF7F9</description>
	<bitRange>[14:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IFF_COMPLEX_DIS</name>
	<description>Put IF-filter in lowpass configuration </description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_IFF_CTRL_SPARE</name>
	<description>Spare register bits</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IFF_DCOC_DAC_DIS</name>
	<description>Disable the DC offset current DAC </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IF_MUTE</name>
	<description>'0': normal operation;
'1': Mute IFF by short circuit of VGA1 input.
Note: set TGATE_MIXER_IF to '0' for isolation from the IRM </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IF_CAL_TRIM</name>
	<description>Current value applied to IF_CAL_CAP</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_IO_CTRL_REG</name>
	<description>IO control register</description>
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000100</resetValue>
	<resetMask>0x00000f0f</resetMask>
	<fields><field>
	<name>RFIO_TUNE_CAP_TRIM_TX</name>
	<description>Trims the tuning cap for TX mode.
Step = 20fF.
0: Minimum cap (all caps off)

7: Maximum cap (all caps on)</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFIO_TUNE_CAP_TRIM_RX</name>
	<description>Trims the RX tuning cap for RX mode.
Step = 20fF.
0: Minimum cap (all caps off)

7: Maximum cap (all caps on)</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_IRQ_CTRL_REG</name>
	<description>IRQ clear register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>EO_CAL_CLEAR</name>
	<description>Writing any value to this bit clears eo_cal interrupt. </description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>RF_LDO_CTRL_REG</name>
	<description>Controls for LDO</description>
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00190333</resetValue>
	<resetMask>0x3f1f0fff</resetMask>
	<fields><field>
	<name>LDO_DCO_HOLD_OVR_EN</name>
	<description>When equals to '1', enables overriding capability for LDO_DCO_HOLD_VREF</description>
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DCO_HOLD_OVR_VAL</name>
	<description>Override value for LDO_DTC_HOLD_VREFwhen LDO_DTC_OVR_EN = 1</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DTC_HOLD_OVR_EN</name>
	<description>When equals to '1', enables overriding capability for LDO_DTC_HOLD_VREF</description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DTC_HOLD_OVR_VAL</name>
	<description>Override value for LDO_DTC_HOLD_VREFwhen LDO_DTC_OVR_EN = 1</description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RADIO_HOLD_OVR_EN</name>
	<description>When equals to '1', enables overriding capability for LDO_RADIO_HOLD_VREF</description>
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RADIO_HOLD_OVR_VAL</name>
	<description>Override value for LDO_RADIO_HOLD_VREFwhen LDO_RADIO_OVR_EN = 1</description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_VREF_SMPL_TIME</name>
	<description>Time (in us) to sample the VREF node after each LDO is enabled</description>
	<bitRange>[20:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DCO_CONT_ENABLE</name>
	<description>Radio LDO continuous enable</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DCO_LEVEL</name>
	<description>Level for Radio LDO</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DTC_CONT_ENABLE</name>
	<description>Radio LDO continuous enable</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DTC_LEVEL</name>
	<description>Level for Radio LDO</description>
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RADIO_CONT_ENABLE</name>
	<description>Radio LDO continuous enable</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RADIO_LEVEL</name>
	<description>Level for Radio LDO</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_LDO_STATUS_REG</name>
	<description>Read out value of LDO enables</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>ldo_dtc_vref_hold_rd</name>
	<description>ADPLLDIG LDO zero enable bit.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ldo_dco_vref_hold_rd</name>
	<description>ADPLLDIG LDO zero enable bit.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ldo_radio_vref_hold_rd</name>
	<description>ADPLLDIG LDO zero enable bit.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ldo_dtc_en_rd</name>
	<description>ADPLLDIG LDO zero enable bit.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ldo_dco_en_rd</name>
	<description>ADPLLDIG LDO zero enable bit.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADPLLDIG_LDO_ZERO_EN_RD</name>
	<description>ADPLLDIG LDO zero enable bit.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADPLLDIG_LDO_EN_RD</name>
	<description>ADPLLDIG LDO enable bit.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RADIO_LDO_ZERO_EN_RD</name>
	<description>Radio LDO zero enable bit.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RADIO_LDO_EN_RD</name>
	<description>Radio LDO enable bit.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_LDO_VREF_SEL_REG</name>
	<description>Vref sel control register</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>RF_LDO_DCO_VREF_SEL</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_LDO_DTC_VREF_SEL</name>
	
