dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_LDO_RADIO_VREF_SEL</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_LNA_CTRL1_REG</name>
	<description>LNA control register</description>
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x01084210</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields><field>
	<name>LNA_TRIM_GAIN4_HP</name>
	<description>High performance LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 1 and lna_gain_sel &gt; 3)</description>
	<bitRange>[24:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN3_HP</name>
	<description>High performance LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 1 and lna_gain_sel = 3)</description>
	<bitRange>[19:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN2_HP</name>
	<description>High performance LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 1 and lna_gain_sel = 2)</description>
	<bitRange>[14:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN1_HP</name>
	<description>High performance LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 1 and lna_gain_sel = 1)</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN0_HP</name>
	<description>High performance LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 1 and lna_gain_sel = 0)
The mode for HP is hardwired to 3.</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_LNA_CTRL2_REG</name>
	<description>LNA control register</description>
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00d6b5ad</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields><field>
	<name>LNA_TRIM_GAIN4_LP</name>
	<description>Low power LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel &gt; 3)</description>
	<bitRange>[24:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN3_LP</name>
	<description>Low power LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 3)</description>
	<bitRange>[19:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN2_LP</name>
	<description>Low power LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 2)</description>
	<bitRange>[14:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN1_LP</name>
	<description>Low power LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 1)</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_GAIN0_LP</name>
	<description>Low power LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 0)</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_LNA_CTRL3_REG</name>
	<description>LNA control register</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00111114</resetValue>
	<resetMask>0x0333333f</resetMask>
	<fields><field>
	<name>LNA_SPARE</name>
	<description>Spare bits for LNA.</description>
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_MODE_GAIN4_LP</name>
	<description>Low power LNA mode setting
(Used as lna_mode value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel &gt; 3)</description>
	<bitRange>[21:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_MODE_GAIN3_LP</name>
	<description>Low power LNA mode setting
(Used as lna_mode value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 3)</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_MODE_GAIN2_LP</name>
	<description>Low power LNA mode setting
(Used as lna_mode value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 2)</description>
	<bitRange>[13:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_MODE_GAIN1_LP</name>
	<description>Low power LNA mode setting
(Used as lna_mode value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 1)</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_MODE_GAIN0_LP</name>
	<description>Low power LNA mode setting
(Used as lna_mode value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 0)</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_TRIM_CASC</name>
	<description>Trims the cascode voltages.
0: lower voltage

7: higher voltage</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_MIXER_CTRL1_REG</name>
	<description>Mixer control register</description>
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x010f010f</resetValue>
	<resetMask>0x01ff01ff</resetMask>
	<fields><field>
	<name>MIXER_IP2_DAC_Q_TRIM</name>
	<description>Trims the IN DAC.
Step = 3.9mV (LSB) for MIXER_IP2_DAC_EXTEND (Bit 25) = 0
Step = 2* 3.9mV (LSB) for MIXER_IP2_DAC_EXTEND (Bit 25) = 1
0: Lowest voltage

63: Highest voltage

Bit 25 (MIXER_IP2_DAC_EXTEND) description needs to be added to this register.</description>
	<bitRange>[24:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MIXER_IP2_DAC_I_TRIM</name>
	<description>Trims the QN DAC.
Step = 3.9mV (LSB) for MIXER_IP2_DAC_EXTEND = 0
Step = 2* 3.9mV (LSB) for MIXER_IP2_DAC_EXTEND = 1
0: Lowest voltage

63: Highest voltage

Bit 25 (MIXER_IP2_DAC_EXTEND) description needs to be added to this register.</description>
	<bitRange>[8:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_MIXER_CTRL2_REG</name>
	<description>Mixer control register</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00010f0f</resetMask>
	<fields><field>
	<name>MIX_CAL_SELECT</name>
	<description>0: use IF_CAL_CAP_1M/2M_SET1, depending on mode. MIX_CAL_CAP_WR is added as offset.
1: use MIX_CAL_CAP_WR directly</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MIX_CAL_CAP_WR_2M</name>
	<description>External value for calibration of mixer pole capacitance for 2M mode.</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MIX_CAL_CAP_WR_1M</name>
	<description>External value for calibration of mixer pole capacitance for 1M mode.</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_OVERRULE_REG</name>
	<description>Overrule register</description>
	<addressOffset>0x000000ac</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>RX_EN_OVR</name>
	<description>Overrule RX_EN
'b01: disabled.
'b1x: enabled.
'b00: normal function</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_EN_OVR</name>
	<description>Overrule TX_EN
'b01: disabled.
'b1x: enabled.
'b00: normal function</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_PA_CTRL_REG</name>
	<description>PA control register</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000300</resetValue>
	<resetMask>0x0000033f</resetMask>
	<fields><field>
	<name>PA_RAMP_STEP_SPEED</name>
	<description>00 no ramping
01 ramp step 125 ns
10 ramp step 250 ns
11 ramp step 500 ns
</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRIM_DUTY_NEG</name>
	<description>Trims the duty-cycle (current starving) resistor at the nmos side
0: lowest resistance (shorted, fastest falling edge)

7: max resistance (slowest falling edge)</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRIM_DUTY_POS</name>
	<description>Trims the duty-cycle (current starving) resistor at the pmos side
0: lowest resistance (shorted, fastest rising edge)

7: max resistance (slowest rising edge)</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_RADIO_INIT_REG</name>
	<description>Radio initialization register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x010303ff</resetMask>
	<fields><field>
	<name>RADIO_INIT_AUTOCLEAR</name>
	<description>LDO mode
0: Clear ADPLLDIG_LDO_EN from FW.
1: Auto-clear ADPLLDIG_LDO_EN on radio_busy negedge if there is no package in IFS.</description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_HCLK_DIS</name>
	<description>Disable adplldig hclk.
0: Do nothing
1: Disable
(It is auto-cleared when ADPLLDIG_HCLK_EN is set to 1)
Remark: Since ADPLLDIG_HCLK_EN has higher priority over ADPLLDIG_HCLK_DIS, ADPLLDIG_HCLK_DIS bit-field cannot be set to 1 with &quot;SetBits()&quot; commands, which access the two bit-fields at the same time. To be able to ADPLLDIG_HCLK_DIS bit-field to 1, &quot;SetByte()&quot; command should be used.</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIO_REGS_RDY</name>
	<description>ADPLLDIG regs loading status bit
(Auto-clear to 0 at phy_busy pos-edge or when ADPLLDIG LDO is off)
0: Loading preferred values is not finished.
1: Loading preferred values is finished.</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_HCLK_EN</name>
	<description>Enable adplldig hclk.
0: Disable
1: Enable
(It is auto-cleared when ADPLLDIG_HCLK_DIS is set to 1)</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_HRESET_N</name>
	<description>Reset Adplldig register file
0: Reset state.
1: Reset is released.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_LDO_EN_WR</name>
	<description>ADPLLDIG LDO EN overrule value.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_LDO_EN_SEL</name>
	<description>Select ADPLLDIG_LDO_EN_WR.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_PWR_SW1_EN</name>
	<description>ADPLLDIG LDO enable bit.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIO_LDO_EN_WR</name>
	<description>Radio LDO EN overrule value.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIO_LDO_EN_SEL</name>
	<description>Select RADIO_LDO_EN_WR.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIO_LDO_EN</name>
	<description>Radio LDO enable bit.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_RFCU_CTRL_REG</name>
	<description>RFCU control register</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>RF_RFCU_CLK_DIV</name>
	<description>Divide the RFCU clock by 2.
0: 16 MHz
1: 8 MHz (default)</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_SCAN_FEEDBACK_REG</name>
	<description>scan feedback register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	
