dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<addressOffset>0x00000114</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000a12</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_7_REG</name>
	
	<addressOffset>0x00000118</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000414</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_tx/eo_tx. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_tx/eo_tx. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_8_REG</name>
	
	<addressOffset>0x0000011c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000c14</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_9_REG</name>
	
	<addressOffset>0x00000120</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000416</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG0_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000083</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>RFIO_LDO_EN_DCF_TX</name>
	<description>DCF timer for rfio_ldo_en in tx mode.</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFIO_LDO_EN_DCF_RX</name>
	<description>DCF timer for rfio_ldo_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG10_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>LNA_LDO_ZERO_DCF_TX</name>
	<description>DCF timer for lna_ldo_zero in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_LDO_ZERO_DCF_RX</name>
	<description>DCF timer for lna_ldo_zero in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG11_REG</name>
	
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000c5</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLLDIG_LDO_ACTIVERDY_DCF_TX</name>
	<description>DCF timer for adplldig_ldo_activerdy in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_LDO_ACTIVERDY_DCF_RX</name>
	<description>DCF timer for adplldig_ldo_activerdy in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG12_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000018b</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLLDIG_LDO_LP_DCF_TX</name>
	<description>DCF timer for adplldig_ldo_lp in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_LDO_LP_DCF_RX</name>
	<description>DCF timer for adplldig_ldo_lp in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG13_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>RFIO_RX_EN_DCF_TX</name>
	<description>DCF timer for rfio_rx_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFIO_RX_EN_DCF_RX</name>
	<description>DCF timer for rfio_rx_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG14_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001c0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>RFIO_TX_EN_DCF_TX</name>
	<description>DCF timer for rfio_tx_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFIO_TX_EN_DCF_RX</name>
	<description>DCF timer for rfio_tx_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG15_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001c0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>RFIO_TX_HARM_EN_DCF_TX</name>
	<description>DCF timer for rfio_tx_harm_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFIO_TX_HARM_EN_DCF_RX</name>
	<description>DCF timer for rfio_tx_harm_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG16_REG</name>
	
