dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000008f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>RFIO_BIAS_EN_DCF_TX</name>
	<description>DCF timer for rfio_bias_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFIO_BIAS_EN_DCF_RX</name>
	<description>DCF timer for rfio_bias_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG17_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000210</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>RFIO_BIAS_SH_OPEN_DCF_TX</name>
	<description>DCF timer for rfio_bias_sh_open in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFIO_BIAS_SH_OPEN_DCF_RX</name>
	<description>DCF timer for rfio_bias_sh_open in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG18_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001a0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>PA_RAMP_EN_DCF_TX</name>
	<description>DCF timer for pa_ramp_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PA_RAMP_EN_DCF_RX</name>
	<description>DCF timer for pa_ramp_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG19_REG</name>
	
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001c0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>PA_EN_DCF_TX</name>
	<description>DCF timer for pa_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PA_EN_DCF_RX</name>
	<description>DCF timer for pa_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG1_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000083</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>PA_LDO_EN_DCF_TX</name>
	<description>DCF timer for pa_ldo_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PA_LDO_EN_DCF_RX</name>
	<description>DCF timer for pa_ldo_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG20_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>LNA_CORE_EN_DCF_TX</name>
	<description>DCF timer for lna_core_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_CORE_EN_DCF_RX</name>
	<description>DCF timer for lna_core_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG21_REG</name>
	
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>LNA_CGM_EN_DCF_TX</name>
	<description>DCF timer for lna_cgm_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LNA_CGM_EN_DCF_RX</name>
	<description>DCF timer for lna_cgm_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG22_REG</name>
	
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>MIX_EN_DCF_TX</name>
	<description>DCF timer for mix_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MIX_EN_DCF_RX</name>
	<description>DCF timer for mix_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG23_REG</name>
	
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>MIX_BIAS_SH_OPEN_DCF_TX</name>
	<description>DCF timer for mix_bias_sh_open in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MIX_BIAS_SH_OPEN_DCF_RX</name>
	<description>DCF timer for mix_bias_sh_open in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG24_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>IFF_EN_DCF_TX</name>
	<description>DCF timer for iff_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IFF_EN_DCF_RX</name>
	<description>DCF timer for iff_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG25_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>IFF_BIAS_SH_OPEN_DCF_TX</name>
	<description>DCF timer for iff_bias_sh_open in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IFF_BIAS_SH_OPEN_DCF_RX</name>
	<description>DCF timer for iff_bias_sh_open in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG26_REG</name>
	
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADC_CLK_EN_DCF_TX</name>
	<description>DCF timer for adc_clk_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_CLK_EN_DCF_RX</name>
	<description>DCF timer for adc_clk_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG27_REG</name>
	
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADC_EN_DCF_TX</name>
	<description>DCF timer for adc_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_EN_DCF_RX</name>
	<description>DCF timer for adc_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG28_REG</name>
	
	<addressOffset>0x00000070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000041</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLL_DCO_EN_DCF_TX</name>
	<description>DCF timer for adpll_dco_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLL_DCO_EN_DCF_RX</name>
	<description>DCF timer for adpll_dco_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG29_REG</name>
	
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000041</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLL_CLK_EN_DCF_TX</name>
	<description>DCF timer for adpll_clk_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLL_CLK_EN_DCF_RX</name>
	<description>DCF timer for adpll_clk_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG2_REG</name>
	
