dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000c5</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLL_RDY_FOR_DIV_DCF_TX</name>
	<description>&quot;Ready for the Dividers&quot; DCF timer in tx mode.</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLL_RDY_FOR_DIV_DCF_RX</name>
	<description>&quot;Ready for the Dividers&quot; DCF timer in tx mode.</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG42_REG</name>
	
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>SPARE1_DCF_TX</name>
	<description>Spare DCF timer in tx mode.</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPARE1_DCF_RX</name>
	<description>Spare DCF timer in rx mode.</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG43_REG</name>
	
	<addressOffset>0x000000ac</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>SPARE2_DCF_TX</name>
	<description>Spare DCF timer in tx mode.</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPARE2_DCF_RX</name>
	<description>Spare DCF timer in rx mode.</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG44_REG</name>
	
	<addressOffset>0x000000b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>SPARE3_DCF_TX</name>
	<description>Spare DCF timer in tx mode.</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPARE3_DCF_RX</name>
	<description>Spare DCF timer in rx mode.</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG45_REG</name>
	
	<addressOffset>0x000000b4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>SPARE4_DCF_TX</name>
	<description>Spare DCF timer in tx mode.</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPARE4_DCF_RX</name>
	<description>Spare DCF timer in rx mode.</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG46_REG</name>
	
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>SPARE5_DCF_TX</name>
	<description>Spare DCF timer in tx mode.</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPARE5_DCF_RX</name>
	<description>Spare DCF timer in rx mode.</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG4_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>IFF_LDO_EN_DCF_TX</name>
	<description>DCF timer for iff_ldo_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IFF_LDO_EN_DCF_RX</name>
	<description>DCF timer for iff_ldo_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG5_REG</name>
	
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>IFFADC_LDO_EN_DCF_TX</name>
	<description>DCF timer for iffadc_ldo_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IFFADC_LDO_EN_DCF_RX</name>
	<description>DCF timer for iffadc_ldo_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG6_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000083</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLL_TDC_LDO_EN_DCF_TX</name>
	<description>DCF timer for adpll_tdc_ldo_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLL_TDC_LDO_EN_DCF_RX</name>
	<description>DCF timer for adpll_tdc_ldo_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG7_REG</name>
	
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000083</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLL_DTC_LDO_EN_DCF_TX</name>
	<description>DCF timer for adpll_dtc_ldo_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLL_DTC_LDO_EN_DCF_RX</name>
	<description>DCF timer for adpll_dtc_ldo_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG8_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000083</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>ADPLL_DCO_LDO_EN_DCF_TX</name>
	<description>DCF timer for adpll_dco_ldo_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLL_DCO_LDO_EN_DCF_RX</name>
	<description>DCF timer for adpll_dco_ldo_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG9_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000041</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>LDO_ZERO_EN_DCF_TX</name>
	<description>DCF timer for ldo_zero_en in tx mode</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_ZERO_EN_DCF_RX</name>
	<description>DCF timer for ldo_zero_en in rx mode</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_PORT_EN_REG</name>
	
