dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/config/toolbox_resources/DA1453x/common/DA14531.xml
	<addressOffset>0x00000188</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>RF_PORT4_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_31_REG</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT4_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_31_REG</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT3_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_30_REG</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT3_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_30_REG</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT2_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_29_REG</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT2_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_29_REG</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT1_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_28_REG</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT1_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_28_REG</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT0_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_27_REG</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT0_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_27_REG</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_PORT_POL_REG</name>
	
	<addressOffset>0x0000018c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>RF_PORT4_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT3_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT2_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT1_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_PORT0_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>RFMON</name>
	<version>1.0</version>
	<description>RFMON registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003500</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>22</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>RFMON_ADDR_REG</name>
	<description>AHB master start address</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RFMON_ADDR</name>
	<description>It is the bits [15:2] of base address that is used by the AHB master interface of the controller. Defines the AHB address from where the controller will start to stores data. The bits [1:0] of the address are considered always 0.</description>
	<bitRange>[15:2]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RFMON_CRV_ADDR_REG</name>
	<description>AHB master current address</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RFMON_CRV_ADDR</name>
	<description>It is the bits [15:2] of AHB address that will be used by the controller in the next memory access. The bits [1:0] are always 0.</description>
	<bitRange>[15:2]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RFMON_CRV_LEN_REG</name>
	<description>The remaining data to be transferred</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RFMON_CRV_LEN</name>
	<description>Indicates the number of words (minus 1) that remain to be transfered.</description>
	<bitRange>[13:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RFMON_CTRL_REG</name>
	<description>Control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RFMON_CIRC_EN</name>
	<description>Write with 1 to enable the circular mode.In circular mode the controller continuously writes data in to the memory until to be disabled by the software. The data are transferred in the circular buffer in the memory, which is defined by the RFMON_ADDR_REG and the RFMON_LEN_REG registers. The disabling of the controller is realized by writing the RFMON_PACK_EN with 0.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFMON_PACK_EN</name>
	<description>Starts the capturing of the data from the test bus
0 : There is no capturing of data.
1 : The controller captures data.
Should be written with 1 in order to start the acquisition of data.
If the controller is not in circular mode (RFMON_CIRC_EN = 0) and after capturing a predefined number of words (RFMON_LEN), this bit will be auto cleared.
In circular mode (RFMON_CIRC_EN = 1) the RFMON_PACK_EN remains 1 until to be cleared by the software.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RFMON_LEN_REG</name>
	<description>Data length register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RFMON_LEN</name>
	<description>The number of words (minus one) that should be captured.</description>
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RFMON_STAT_REG</name>
	<description>Status register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RFMON_OFLOW_STK</name>
	<description>Indicates that during the transfer of the data, at least one overflow has detected to the fifo.
0 : The transfer completed without overflows.
1 : At least one overflow occured in the fifo.
Write 1 to clear this bit. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFMON_ACTIVE</name>
	<description>Indicates the state of the controller.
0 : The controller is idle.
1 : The controller is active. The capturing process and/or the dma activity is in progress.
The controller will be activated (RFMON_ACTIVE == 1), when RFMON_PACK_EN will be written with 1. Will return to inactive state, after the end of the capturing process (RFMON_PACK_EN==0) and the completion of the transfer of all of the data to the memory. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>RTC</name>
	<version>1.0</version>
	<description>RTC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50004100</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>52</size>
	<usage>registers</usage>
</addressBlock>
	
